#include "stdafx.h"
#include "char.h"
#include "../common/CommonDefines.h"

#ifdef USE_CRYSTAL_SYSTEM
std::map<BYTE, std::vector<WORD>> m_mapCrystalBonuses
{
	{ APPLY_ATTBONUS_MONSTER, { 2, 4, 6, 8 } },
	{ APPLY_ATTBONUS_STONE, { 2, 4, 6, 8 } },
	{ APPLY_ATTBONUS_BOSS, { 2, 4, 6, 8 } },
	{ APPLY_ATT_GRADE_BONUS, { 20, 40, 60, 80 } },
	{ APPLY_NORMAL_HIT_DAMAGE_BONUS, { 1, 2, 3, 4 } },
	{ APPLY_ATTBONUS_HUMAN, { 2, 4, 6, 8 } },
	{ APPLY_CAST_SPEED, { 5, 10, 15, 20 } },
	{ APPLY_MAX_HP, { 500, 1000, 1500, 2000 } },
	{ APPLY_SKILL_DAMAGE_BONUS, { 2, 4, 6, 8 } },
	{ APPLY_SKILL_DEFEND_BONUS, { 2, 4, 6, 8 } }
};
#endif

#ifdef USE_PASSIVE_ABILITY_TAMER
std::unordered_map<int, uint8_t> m_mapPassiveAbilityTamerBnsType
{
	{ PASSIVE_ABILITY_VNUM_TAMER_1, POINT_ATTBONUS_MONSTER },
#ifdef NEW_BONUS
	{ PASSIVE_ABILITY_VNUM_TAMER_2, POINT_ATTBONUS_STONE },
	{ PASSIVE_ABILITY_VNUM_TAMER_3, POINT_ATTBONUS_BOSS },
#else
	{ PASSIVE_ABILITY_VNUM_TAMER_2, POINT_NONE },
	{ PASSIVE_ABILITY_VNUM_TAMER_3, POINT_NONE },
#endif
	{ PASSIVE_ABILITY_VNUM_TAMER_4, POINT_ATTBONUS_HUMAN }
};

uint8_t m_bPassiveAbilityTamerBookCount[SKILL_MAX_LEVEL + 1] = 
{
	1,	// 0
	1,	// 1
	1,	// 2
	1,	// 3
	1,	// 4
	1,	// 5
	1,	// 6
	1,	// 7
	1,	// 8
	1,	// 9
	1,	// 10
	1,	// 11
	1,	// 12
	1,	// 13
	1,	// 14
	1,	// 15
	1,	// 16
	1,	// 17
	1,	// 18
	1,	// 19
	1,	// 20 -> M1
	2,	// 21
	3,	// 22
	4,	// 23
	5,	// 24
	6,	// 25
	7,	// 26
	8,	// 27
	9,	// 28
	10,	// 29
	1,	// 30 -> G1
	2,	// 31
	3,	// 32
	4,	// 33
	5,	// 34
	6,	// 35
	7,	// 36
	8,	// 37
	9,	// 38
	10,	// 39
	0	// 40 -> P
};

int64_t m_vPassiveAbilityTamerBnsValue[PASSIVE_ABILITY_VNUM_TAMER_MAX_COUNT][SKILL_MAX_LEVEL + 1] = 
{
	{
		0,	// 0
		1,	// 1
		1,	// 2
		1,	// 3
		1,	// 4
		1,	// 5
		2,	// 6
		2,	// 7
		2,	// 8
		2,	// 9
		2,	// 10
		3,	// 11
		3,	// 12
		3,	// 13
		3,	// 14
		3,	// 15
		4,	// 16
		4,	// 17
		4,	// 18
		4,	// 19
		5,	// 20 -> M1
		5,	// 21
		5,	// 22
		6,	// 23
		6,	// 24
		7,	// 25
		7,	// 26
		8,	// 27
		8,	// 28
		9,	// 29
		10,	// 30 -> G1
		11,	// 31
		12,	// 32
		13,	// 33
		14,	// 34
		15,	// 35
		16,	// 36
		17,	// 37
		18,	// 38
		19,	// 39
		20	// 40 -> P
	},
	{
		0,	// 0
		1,	// 1
		1,	// 2
		1,	// 3
		1,	// 4
		1,	// 5
		2,	// 6
		2,	// 7
		2,	// 8
		2,	// 9
		2,	// 10
		3,	// 11
		3,	// 12
		3,	// 13
		3,	// 14
		3,	// 15
		4,	// 16
		4,	// 17
		4,	// 18
		4,	// 19
		5,	// 20 -> M1
		5,	// 21
		5,	// 22
		6,	// 23
		6,	// 24
		7,	// 25
		7,	// 26
		8,	// 27
		8,	// 28
		9,	// 29
		10,	// 30 -> G1
		11,	// 31
		12,	// 32
		13,	// 33
		14,	// 34
		15,	// 35
		16,	// 36
		17,	// 37
		18,	// 38
		19,	// 39
		20	// 40 -> P
	},
	{
		0,	// 0
		1,	// 1
		1,	// 2
		1,	// 3
		1,	// 4
		1,	// 5
		2,	// 6
		2,	// 7
		2,	// 8
		2,	// 9
		2,	// 10
		3,	// 11
		3,	// 12
		3,	// 13
		3,	// 14
		3,	// 15
		4,	// 16
		4,	// 17
		4,	// 18
		4,	// 19
		5,	// 20 -> M1
		5,	// 21
		5,	// 22
		6,	// 23
		6,	// 24
		7,	// 25
		7,	// 26
		8,	// 27
		8,	// 28
		9,	// 29
		10,	// 30 -> G1
		11,	// 31
		12,	// 32
		13,	// 33
		14,	// 34
		15,	// 35
		16,	// 36
		17,	// 37
		18,	// 38
		19,	// 39
		20	// 40 -> P
	},
	{
		0,	// 0
		1,	// 1
		1,	// 2
		1,	// 3
		1,	// 4
		1,	// 5
		2,	// 6
		2,	// 7
		2,	// 8
		2,	// 9
		2,	// 10
		3,	// 11
		3,	// 12
		3,	// 13
		3,	// 14
		3,	// 15
		4,	// 16
		4,	// 17
		4,	// 18
		4,	// 19
		5,	// 20 -> M1
		5,	// 21
		5,	// 22
		6,	// 23
		6,	// 24
		7,	// 25
		7,	// 26
		8,	// 27
		8,	// 28
		9,	// 29
		10,	// 30 -> G1
		11,	// 31
		12,	// 32
		13,	// 33
		14,	// 34
		15,	// 35
		16,	// 36
		17,	// 37
		18,	// 38
		19,	// 39
		20	// 40 -> P
	}
};
#endif

#if defined(ENABLE_2LOOT)
#include "db.h"
#include "config.h"

std::map<BYTE, std::vector<DWORD>> m_map2Loot;

bool Is2Loot(DWORD dwMobVnum, BYTE bType) {
	auto it = m_map2Loot.find(bType);
	if (it == m_map2Loot.end())
		return false;

	for (auto dwVnum : it->second) {
		if (dwMobVnum == dwVnum) {
			return true;
		}
	}

	return false;
}

/* BOOS  = 1; STONE = 2 */
void Init2Loot() {
	char szQuery[QUERY_MAX_LEN];
	snprintf(szQuery, sizeof(szQuery), "SELECT type+0, vnum FROM %s2loot", get_table_postfix());

	std::unique_ptr<SQLMsg> pMsg(DBManager::instance().DirectQuery(szQuery));
	if (!pMsg->Get() || pMsg->Get()->uiNumRows == 0)
		return;

	MYSQL_ROW row = NULL;
	while ((row = mysql_fetch_row(pMsg->Get()->pSQLResult)))
	{
		BYTE bType = 0;
		str_to_number(bType, row[0]);

		DWORD dwMobVnum = 0;
		str_to_number(dwMobVnum, row[1]);

		auto it = m_map2Loot.find(bType);
		if (it == m_map2Loot.end()) {
			std::vector<DWORD> vect2Loot;
			vect2Loot.push_back(dwMobVnum);
			m_map2Loot.insert(std::pair<BYTE, std::vector<DWORD>>(bType, vect2Loot));
		}
		else {
			it->second.push_back(dwMobVnum);
		}
	}
}
#endif

#ifdef ENABLE_BIYOLOG

BYTE pointToApply(BYTE p)
{
	switch (p)
	{
		case POINT_MOV_SPEED:
			return APPLY_MOV_SPEED;
		case POINT_ATT_SPEED:
			return APPLY_ATT_SPEED;
		case POINT_DEF_GRADE_BONUS:
			return APPLY_DEF_GRADE_BONUS;
		case POINT_ATT_GRADE_BONUS:
			return APPLY_ATT_GRADE_BONUS;
		case POINT_RESIST_WARRIOR:
			return APPLY_RESIST_WARRIOR;
		case POINT_RESIST_ASSASSIN:
			return APPLY_RESIST_ASSASSIN;
		case POINT_RESIST_SURA:
			return APPLY_RESIST_SURA;
		case POINT_RESIST_SHAMAN:
			return APPLY_RESIST_SHAMAN;
		case POINT_ATTBONUS_WARRIOR:
			return APPLY_ATTBONUS_WARRIOR;
		case POINT_ATTBONUS_ASSASSIN:
			return APPLY_ATTBONUS_ASSASSIN;
		case POINT_ATTBONUS_SURA:
			return APPLY_ATTBONUS_SURA;
		case POINT_ATTBONUS_SHAMAN:
			return APPLY_ATTBONUS_SHAMAN;
		case POINT_MAX_HP:
			return APPLY_MAX_HP;
		case POINT_ATTBONUS_MONSTER:
			return APPLY_ATTBONUS_MONSTER;
		case POINT_ATTBONUS_STONE:
			return APPLY_ATTBONUS_STONE;
		case POINT_ATTBONUS_BOSS:
			return APPLY_ATTBONUS_BOSS;
		case POINT_RESIST_HUMAN:
			return APPLY_RESIST_HUMAN;
		case POINT_ATTBONUS_HUMAN:
			return APPLY_ATTBONUS_HUMAN;
		case POINT_MELEE_MAGIC_ATT_BONUS_PER:
			return APPLY_MELEE_MAGIC_ATTBONUS_PER;
		case POINT_CASTING_SPEED:
			return APPLY_CAST_SPEED;
#ifdef USE_DROP_AFFECT_BONUSES
		case POINT_DOUBLE_DROP_METIN:
			return APPLY_DOUBLE_DROP_METIN;
		case POINT_DOUBLE_DROP_BOSS:
			return APPLY_DOUBLE_DROP_BOSS;
#endif
	}
	return APPLY_NONE;
}
const BYTE bio_max = 14;// SEt everytime.
const DWORD bio_data[][17] = {
	// level, item, count, time, lucky, stone, afftype1, affvalue1, afftype2, affvalue2, afftype3, affvalue3 , afftype4, affvalue4, isChoose
		{ 0, 0, 0, 0, 0, 0, 0, 0,0,0,0,0,0,0,0,0,0},//empty
		{ 30, 30006, 10, 600, 60, 30220, POINT_DEF_GRADE_BONUS, 80,0,0,0,0,0,0,0, 71035, 30250},//Dientes orco
		{ 40, 30047, 15, 600, 60, 30221, POINT_ATT_GRADE_BONUS, 60,0,0,0,0,0,0,0, 71035, 30250},//Libro maldicion
		{ 50, 30015, 15, 900, 60, 30222, POINT_ATTBONUS_MONSTER, 5,0,0,0,0,0,0,0, 71035, 30250},//Recuerdo del demonio
		{ 60, 30050, 20, 900, 60, 30223, POINT_ATTBONUS_STONE, 5,0,0,0,0,0,0,0, 71035, 30250},//Bola de hielo
		{ 70, 300004, 25, 1800, 60, 30224, POINT_ATTBONUS_BOSS, 5,0,0,0,0,0,0,0, 71035, 30250},//Ramas Zelkova
		{ 80, 300005, 30, 1800, 60, 30225, POINT_MAX_HP, 1000,0,0,0,0,0,0,0, 71035, 30250},//Panel Tugyis
		{ 85, 300006, 40, 2700, 60, 30226, POINT_ATTBONUS_BOSS, 8,0,0,0,0,0,0,0, 71035, 30250},//Rama arbol Rojo Fantasma
		{ 90, 300007, 50, 3600, 60, 30227, POINT_ATTBONUS_MONSTER, 8,0,0,0,0,0,0,0, 71035, 30250},//Notas del Lider
		{ 92, 300008, 10, 7200, 60, 30228, POINT_MAX_HP, 1200,0,0,0,0,0,0,0, 71035, 30250},//Joya de la envidia
		{ 94, 300009, 20, 7200, 60, 30229, POINT_ATTBONUS_HUMAN, 10,0,0,0,0,0,0,0, 71035, 30250},//Joya de la sabiduria
		{ 98, 300010, 35, 10800, 60, 30230, POINT_ATTBONUS_MONSTER, 10,0,0,0,0,0,0,0, 71035, 30250},//Pluma Fenix
		{ 100, 300011, 35, 10800, 60, 30231, POINT_ATTBONUS_STONE, 10,0,0,0,0,0,0,0, 71035, 30250},//Monoculo Rojo
		{ 105, 300012, 35, 10800, 60, 30232, POINT_ATTBONUS_BOSS, 10,0,0,0,0,0,0,0, 71035, 30250},//Recetas antiguas
};
#endif

#ifdef __AURA_SYSTEM__
int s_aiAuraRefineInfo[AURA_GRADE_MAX_NUM][AURA_REFINE_INFO_MAX] = {
//  [ Grade | LevelMin | LevelMax | NeedEXP | EvolMaterial | EvolMaterialCount | EvolCost | EvolPCT ]
	{1,   1,  49,  1000, 30617, 20,  50000000, 100},
	{2,  50,  99,  2000, 30617, 50,  50000000, 100},
	{3, 100, 149,  4000, 30616, 20,  50000000, 100},
	{4, 150, 199,  8000, 30616, 40,  80000000, 100},
	{5, 200, 249, 16000, 30618, 40, 100000000, 100},
	{6, 250, 250,     0,     0,  0,        0,   0},
	{0,   0,   0,     0,     0,  0,        0,   0}
};

int* GetAuraRefineInfo(BYTE bLevel)
{
	if (bLevel > 250)
		return NULL;

	for (int i = 0; i < AURA_GRADE_MAX_NUM; ++i)
	{
		if (bLevel >= s_aiAuraRefineInfo[i][AURA_REFINE_INFO_LEVEL_MIN] && bLevel <= s_aiAuraRefineInfo[i][AURA_REFINE_INFO_LEVEL_MAX])
			return s_aiAuraRefineInfo[i];
	}

	return NULL;
}

int GetAuraRefineInfo(BYTE bGrade, BYTE bInfo)
{
	if (bGrade >= AURA_GRADE_MAX_NUM || bInfo >= AURA_REFINE_INFO_MAX)
		return 0;

	return s_aiAuraRefineInfo[bGrade - 1][bInfo];
}
#endif


#ifdef ENABLE_NEW_PET_SYSTEM
std::map<BYTE, std::vector<std::pair<DWORD, WORD>>> petEvolutionItems{
	{0, {{55004, 5}, {30193, 5}, {30059, 5}, {70036, 10}, {91116, 10} }},
	{1, {{55005, 5}, {71123, 5}, {71129, 5}, {31081, 5}, {91116, 10} }},
	{2, {{55006, 5}, {30524, 5}, {30525, 5}, {31230, 10}, {31231, 10}, {31035, 50} }}
};

std::map<BYTE, std::vector<std::pair<BYTE, long>>> petSkillBonus
{
	{1, {{APPLY_ATTBONUS_STONE,10} }},
	{2, {{APPLY_ATTBONUS_MONSTER,10} }},
	{3, {{APPLY_ATTBONUS_BOSS,10} }},
	{4, {{APPLY_STR,10} }},
	{5, {{APPLY_INT,10} }},
	{6, {{APPLY_DEX,10} }},
	{7, {{APPLY_CON,10} }},
	{8, {{APPLY_ATTBONUS_ANIMAL,15} }},
	{9, {{APPLY_ATTBONUS_ORC,15} }},
	{10, {{APPLY_ATTBONUS_MILGYO,15} }},
	{11, {{APPLY_ATTBONUS_UNDEAD,15} }},
	{12, {{APPLY_ATTBONUS_DEVIL,15} }},
	{13, {{APPLY_EXP_DOUBLE_BONUS,10} }},
	{14, {{APPLY_ITEM_DROP_BONUS,10} }},
	{15, {{APPLY_GOLD_DOUBLE_BONUS,20} }},
	{16, {{APPLY_ATTBONUS_HUMAN,5} }},
	{17, {{APPLY_RESIST_HUMAN,5} }},
	{18, {{APPLY_SKILL_DAMAGE_BONUS,5} }},
	{19, {{APPLY_SKILL_DEFEND_BONUS,5} }},
	{20, {{APPLY_NORMAL_HIT_DAMAGE_BONUS,10} }},
	{21, {{APPLY_NORMAL_HIT_DEFEND_BONUS,10} }},
	{22, {{APPLY_ANTI_CRITICAL_PCT,10} }},
	{23, {{APPLY_ANTI_PENETRATE_PCT,10} }},
	{24, {{APPLY_CAST_SPEED,15} }},
	{25, {{APPLY_BLOCK,10} }},
	{26, {{APPLY_POISON_REDUCE,10} }},
	{27, {{APPLY_RESIST_ICE,10} }},
	{28, {{APPLY_RESIST_EARTH,10} }},
	{29, {{APPLY_RESIST_DARK,10} }},
};

BYTE petEvolutionLimits[PET_MAX_EVOLUTION_CONST + 1]{ 40, 75, 100, 120 };
#endif

TJobInitialPoints JobInitialPoints[JOB_MAX_NUM] =
/*
   {
   int st, ht, dx, iq;
   int max_hp, max_sp;
   int hp_per_ht, sp_per_iq;
   int hp_per_lv_begin, hp_per_lv_end;
   int sp_per_lv_begin, sp_per_lv_end;
   int max_stamina;
   int stamina_per_con;
   int stamina_per_lv_begin, stamina_per_lv_end;
   }
 */
{
	// str con dex int ÃÊ±âHP ÃÊ±âSP  CON/HP INT/SP  HP·£´ý/lv   MP·£´ý/lv  ÃÊ±âstam  stam/con stam/lv
	{   6,  4,  3,  3,  600,   200,     40,    20,    36, 44,     18, 22,     800,      5,      1, 3  }, // JOB_WARRIOR  16
	{   4,  3,  6,  3,  650,   200,     40,    20,    36, 44,     18, 22,     800,      5,      1, 3  }, // JOB_ASSASSIN 16
	{   5,  3,  3,  5,  650,   200,     40,    20,    36, 44,     18, 22,     800,      5,      1, 3  }, // JOB_SURA	 16
	{   3,  4,  3,  6,  700,   200,     40,    20,    36, 44,     18, 22,     800,      5,      1, 3  },  // JOB_SHAMANa  16
#ifdef ENABLE_WOLFMAN_CHARACTER
	{   2,  6,  6,  2,  600,   200,     40,    20,    36, 44,     18, 22,     800,      5,      1, 3  }, // JOB_WOLFMAN  16  // TODO: 4°³´É·ÂÄ¡ ÃÊ±â°ª ¿Ü¿¡ ´Ù¸¥ ½ºÅÈ ÇÊ¿ä (±âÈ¹ÀÚÇÑÅ× ¿äÃ»)
#endif
};

const TMobRankStat MobRankStats[MOB_RANK_MAX_NUM] =
/*
   {
   int         iGoldPercent;
   }
 */
{
	{  20,  }, // MOB_RANK_PAWN,
	{  20,  }, // MOB_RANK_S_PAWN,
	{  25,  }, // MOB_RANK_KNIGHT,
	{  30,  }, // MOB_RANK_S_KNIGHT,
	{  50,  }, // MOB_RANK_BOSS,
	{ 100,  }  // MOB_RANK_KING,
};

TBattleTypeStat BattleTypeStats[BATTLE_TYPE_MAX_NUM] =
/*
   {
   int         AttGradeBias;
   int         DefGradeBias;
   int         MagicAttGradeBias;
   int         MagicDefGradeBias;
   }
 */
{
	{	  0,	  0,	  0,	-10	}, // BATTLE_TYPE_MELEE,
	{	 10,	-20,	-10,	-15	}, // BATTLE_TYPE_RANGE,
	{	 -5,	 -5,	 10,	 10	}, // BATTLE_TYPE_MAGIC,
	{	  0,	  0,	  0,	  0	}, // BATTLE_TYPE_SPECIAL,
	{	 10,	-10,	  0,	-15	}, // BATTLE_TYPE_POWER,
	{	-10,	 10,	-10,	  0	}, // BATTLE_TYPE_TANKER,
	{	 20,	-20,	  0,	-10	}, // BATTLE_TYPE_SUPER_POWER,
	{	-20,	 20,	-10,	  0	}, // BATTLE_TYPE_SUPER_TANKER,
};

#ifdef __NEWPET_SYSTEM__
DWORD * exppet_table = NULL;
//const DWORD pets = 4;
const DWORD Pet_Table[4][2] =
{
	{ 55701, 34041 },
	{ 55702, 34045 },
	{ 55703, 34049 },
	{ 55704, 34053 }
};

const DWORD Pet_Skill_Table[18][23] =
{
	//Level Like Index ->> Bonus Value --> typeSkill --> CoolDown -->> Percentage
	{ 78, 0, 0, 1, 1, 2, 2, 3, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 11, 12 },
	{ 80, 0, 0, 1, 1, 2, 2, 3, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 11, 12 },
	{ 79, 0, 0, 1, 1, 2, 2, 3, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 11, 12 },
	{ 81, 0, 0, 1, 1, 2, 2, 3, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 11, 12 },
	{ 95, 0, 0, 1, 1, 2, 2, 3, 3, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 11, 12 }, //5
	{ 53, 0, 0, 2, 4, 6, 8, 10, 12, 14, 16, 20, 22, 24, 26, 30, 34, 38, 42, 50, 58, 66, 75 },
	{ 97, 0, 0, 1, 1, 2, 3, 3, 4, 4, 5, 5, 6, 7, 7, 8, 8, 9, 10, 10, 11, 11, 12 },
	{ 9, 0, 0, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 14, 14, 15, 15, 16, 16, 17, 17, 17 },
	{ 16, 0, 0, 1, 1, 2, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 7, 8, 8, 9, 9 },
	{ 4, 1, 480, 17, 68, 153, 272, 425, 612, 833, 1088, 1377, 1700, 2057, 2448, 2873, 3332, 3825, 4352, 4913, 5508, 6137, 6800 }, //10
	{ 23, 0, 0, 1, 1, 1, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5 },
	{ 24, 0, 0, 1, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 6, 6, 6, 6, 6 },
	{ 27, 0, 0, 1, 1, 2, 2, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 10, 10, 11, 11 },
	{ 28, 0, 0, 1, 2, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 7, 7 },
	{ 44, 0, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20 }, //15
	{ 52, 0, 0, 1, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 6, 6, 6, 6 },
	{ 11, 1, 600, 2, 4, 6, 7, 8, 9, 11, 12, 13, 15, 16, 17, 18, 20, 21, 22, 25, 31, 42, 51 },
	{ 6, 1, 480, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 }


};

const DWORD Pet_SKill_TablePerc[3][20] =
{
	{ 2, 5, 8, 11, 13, 16, 19, 22, 24, 27, 30, 33, 35, 38, 41, 44, 46, 49, 52, 55 },
	{ 2, 5, 7, 10, 12, 15, 17, 20, 23, 25, 27, 30, 32, 35, 37, 40, 42, 45, 47, 50 },
	{ 2, 5, 8, 11, 13, 16, 19, 22, 25, 27, 30, 33, 36, 38, 41, 44, 47, 50, 52, 55 }
};

DWORD exppet_table_common[121];
#endif

#ifdef ENABLE_YOHARA_SYSTEM
const DWORD* conqueror_exp_table = NULL;
const DWORD exp_table_conqueror_common[PLAYER_CONQUEROR_LEVEL + 1] =
{
	0,			// 0
	433400,		// 1
	1300204,	// 2
	2600413,	// 3
	4334029,	// 4
	6501054,	// 5
	9101490,	// 6
	12135339,	// 7
	15602603,	// 8
	19503284,	// 9
	23837384,	// 10
	28604905,	// 11
	33805849,	// 12
	39440218,	// 13
	45508014,	// 14
	52009239,	// 15
	58943895,	// 16
	66311984,	// 17
	74113508,	// 18
	82348469,	// 19
	91016869,	// 20
	100118710,	// 21
	109653994,	// 22
	119622723,	// 23
	130024899,	// 24
	140860524,	// 25
	152129600,	// 26
	163832129,	// 27
	175968113,	// 28
	188537554,	// 29
	0,			// 30
};
#endif

const DWORD * exp_table = NULL;

const DWORD exp_table_common[PLAYER_MAX_LEVEL_CONST + 1] =
{
	0,			// 0
	300,
	800,
	1500,
	2500,
	4300,
	7200,
	11000,
	17000,
	24000,
	33000,		// 10
	43000,
	58000,
	76000,
	100000,
	130000,
	169000,
	219000,
	283000,
	365000,
	472000,		// 20
	610000,
	705000,
	813000,
	937000,
	1077000,
	1237000,
	1418000,
	1624000,
	1857000,
	2122000,	// 30
	2421000,
	2761000,
	3145000,
	3580000,
	4073000,
	4632000,
	5194000,
	5717000,
	6264000,
	6837000,	// 40
	7600000,
	8274000,
	8990000,
	9753000,
	10560000,
	11410000,
	12320000,
	13270000,
	14280000,
	15340000,	// 50
	16870000,
	18960000,
	19980000,
	21420000,
	22930000,
	24530000,
	26200000,
	27960000,
	29800000,
	32780000,	// 60
	36060000,
	39670000,
	43640000,
	48000000,
	52800000,
	58080000,
	63890000,
	70280000,
	77310000,
	85040000,	// 70
	93540000,
	102900000,
	113200000,
	124500000,
	137000000,
	150700000,
	165700000,
	236990000,
	260650000,
	286780000,	// 80
	315380000,
	346970000,
	381680000,
	419770000,
	461760000,
	508040000,
	558740000,
	614640000,
	676130000,
	743730000,	// 90
	1041222000,
	1145344200,
	1259878620,
	1385866482,
	1524453130,
	1676898443,
	1844588288,
	2029047116,
	2050000000,
	2150000000u,// 100
	2210000000u,
	2250000000u,
	2280000000u,
	2310000000u,
	2330000000u,
	2350000000u,
	2370000000u,
	2390000000u,
	2400000000u,
	2410000000u,// 110
	2420000000u,
	2430000000u,
	2440000000u,
	2450000000u,
	2460000000u,
	2470000000u,
	2480000000u,
	2490000000u,
	2490000000u,
	2500000000u,// 120
	2500000000u	// extra
};

const int * aiPercentByDeltaLev = NULL;
const int * aiPercentByDeltaLevForBoss = NULL;

// Àû°ú ³ª¿ÍÀÇ ·¹º§Â÷ÀÌ¿¡ ÀÇÇÑ °è»ê¿¡ »ç¿ëµÇ´Â Å×ÀÌºí
// MIN(MAX_EXP_DELTA_OF_LEV - 1, (Àû·¾ + 15) - ³»·¾))
const int aiPercentByDeltaLevForBoss_euckr[MAX_EXP_DELTA_OF_LEV] =
{
	1,      // -15  0
	3,          // -14  1
	5,          // -13  2
	7,          // -12  3
	15,         // -11  4
	30,         // -10  5
	60,         // -9   6
	90,         // -8   7
	91,         // -7   8
	92,         // -6   9
	93,         // -5   10
	94,         // -4   11
	95,         // -3   12
	97,         // -2   13
	99,         // -1   14
	100,        // 0    15
	105,        // 1    16
	110,        // 2    17
	115,        // 3    18
	120,        // 4    19
	125,        // 5    20
	130,        // 6    21
	135,        // 7    22
	140,        // 8    23
	145,        // 9    24
	150,        // 10   25
	155,        // 11   26
	160,        // 12   27
	165,        // 13   28
	170,        // 14   29
	180         // 15   30
};



const int aiPercentByDeltaLev_euckr[MAX_EXP_DELTA_OF_LEV] =
{
	1,  //  -15 0
	5,  //  -14 1
	10, //  -13 2
	20, //  -12 3
	30, //  -11 4
	50, //  -10 5
	70, //  -9  6
	80, //  -8  7
	85, //  -7  8
	90, //  -6  9
	92, //  -5  10
	94, //  -4  11
	96, //  -3  12
	98, //  -2  13
	100,    //  -1  14
	100,    //  0   15
	105,    //  1   16
	110,    //  2   17
	115,    //  3   18
	120,    //  4   19
	125,    //  5   20
	130,    //  6   21
	135,    //  7   22
	140,    //  8   23
	145,    //  9   24
	150,    //  10  25
	155,    //  11  26
	160,    //  12  27
	165,    //  13  28
	170,    //  14  29
	180,    //  15  30
};

const DWORD party_exp_distribute_table[PLAYER_EXP_TABLE_MAX + 1] =
{
	0,
	10,		10,		10,		10,		15,		15,		20,		25,		30,		40,		// 1 - 10
	50,		60,		80,		100,	120,	140,	160,	184,	210,	240,	// 11 - 20
	270,	300,	330,	360,	390,	420,	450,	480,	510,	550,	// 21 - 30
	600,	640,	700,	760,	820,	880,	940,	1000,	1100,	1180,	// 31 - 40
	1260,	1320,	1380,	1440,	1500,	1560,	1620,	1680,	1740,	1800,	// 41 - 50
	1860,	1920,	2000,	2100,	2200,	2300,	2450,	2600,	2750,	2900,	// 51 - 60
	3050,	3200,	3350,	3500,	3650,	3800,	3950,	4100,	4250,	4400,	// 61 - 70
	4600,	4800,	5000,	5200,	5400,	5600,	5800,	6000,	6200,	6400,	// 71 - 80
	6600,	6900,	7100,	7300,	7600,	7800,	8000,	8300,	8500,	8800,	// 81 - 90
	9000,	9000,	9000,	9000,	9000,	9000,	9000,	9000,	9000,	9000,	// 91 - 100
	10000,	10000,	10000,	10000,	10000,	10000,	10000,	10000,	10000,	10000,	// 101 - 110
	12000,	12000,	12000,	12000,	12000,	12000,	12000,	12000,	12000,	12000,	// 111 - 120
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 130
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 140
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 150
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 160
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 170
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 180
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 190
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 200
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 210
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 220
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 230
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 240
	// 14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	14000,	// 250
};

Coord aArroundCoords[ARROUND_COORD_MAX_NUM] =
{
	{	     0,	      0	    },
	{        0,      50     },
	{       35,     35      },
	{       50,     -0      },
	{       35,     -35     },
	{       0,      -50     },
	{       -35,    -35     },
	{       -50,    0       },
	{       -35,    35      },
	{       0,      100     },
	{       71,     71      },
	{       100,    -0      },
	{       71,     -71     },
	{       0,      -100    },
	{       -71,    -71     },
	{       -100,   0       },
	{       -71,    71      },
	{       0,      150     },
	{       106,    106     },
	{       150,    -0      },
	{       106,    -106    },
	{       0,      -150    },
	{       -106,   -106    },
	{       -150,   0       },
	{       -106,   106     },
	{       0,      200     },
	{       141,    141     },
	{       200,    -0      },
	{       141,    -141    },
	{       0,      -200    },
	{       -141,   -141    },
	{       -200,   0       },
	{       -141,   141     },
	{       0,      250     },
	{       177,    177     },
	{       250,    -0      },
	{       177,    -177    },
	{       0,      -250    },
	{       -177,   -177    },
	{       -250,   0       },
	{       -177,   177     },
	{       0,      300     },
	{       212,    212     },
	{       300,    -0      },
	{       212,    -212    },
	{       0,      -300    },
	{       -212,   -212    },
	{       -300,   0       },
	{       -212,   212     },
	{       0,      350     },
	{       247,    247     },
	{       350,    -0      },
	{       247,    -247    },
	{       0,      -350    },
	{       -247,   -247    },
	{       -350,   0       },
	{       -247,   247     },
	{       0,      400     },
	{       283,    283     },
	{       400,    -0      },
	{       283,    -283    },
	{       0,      -400    },
	{       -283,   -283    },
	{       -400,   0       },
	{       -283,   283     },
	{       0,      450     },
	{       318,    318     },
	{       450,    -0      },
	{       318,    -318    },
	{       0,      -450    },
	{       -318,   -318    },
	{       -450,   0       },
	{       -318,   318     },
	{       0,      500     },
	{       354,    354     },
	{       500,    -0      },
	{       354,    -354    },
	{       0,      -500    },
	{       -354,   -354    },
	{       -500,   0       },
	{       -354,   354     },
	{       0,      550     },
	{       389,    389     },
	{       550,    -0      },
	{       389,    -389    },
	{       0,      -550    },
	{       -389,   -389    },
	{       -550,   0       },
	{       -389,   389     },
	{       0,      600     },
	{       424,    424     },
	{       600,    -0      },
	{       424,    -424    },
	{       0,      -600    },
	{       -424,   -424    },
	{       -600,   0       },
	{       -424,   424     },
	{       0,      650     },
	{       460,    460     },
	{       650,    -0      },
	{       460,    -460    },
	{       0,      -650    },
	{       -460,   -460    },
	{       -650,   0       },
	{       -460,   460     },
	{       0,      700     },
	{       495,    495     },
	{       700,    -0      },
	{       495,    -495    },
	{       0,      -700    },
	{       -495,   -495    },
	{       -700,   0       },
	{       -495,   495     },
	{       0,      750     },
	{       530,    530     },
	{       750,    -0      },
	{       530,    -530    },
	{       0,      -750    },
	{       -530,   -530    },
	{       -750,   0       },
	{       -530,   530     },
	{       0,      800     },
	{       566,    566     },
	{       800,    -0      },
	{       566,    -566    },
	{       0,      -800    },
	{       -566,   -566    },
	{       -800,   0       },
	{       -566,   566     },
	{       0,      850     },
	{       601,    601     },
	{       850,    -0      },
	{       601,    -601    },
	{       0,      -850    },
	{       -601,   -601    },
	{       -850,   0       },
	{       -601,   601     },
	{       0,      900     },
	{       636,    636     },
	{       900,    -0      },
	{       636,    -636    },
	{       0,      -900    },
	{       -636,   -636    },
	{       -900,   0       },
	{       -636,   636     },
	{       0,      950     },
	{       672,    672     },
	{       950,    -0      },
	{       672,    -672    },
	{       0,      -950    },
	{       -672,   -672    },
	{       -950,   0       },
	{       -672,   672     },
	{       0,      1000    },
	{       707,    707     },
	{       1000,   -0      },
	{       707,    -707    },
	{       0,      -1000   },
	{       -707,   -707    },
	{       -1000,  0       },
	{       -707,   707     },
};

const DWORD guild_exp_table[GUILD_MAX_LEVEL+1] =
{
	0,
	15000UL,
	45000UL,
	90000UL,
	160000UL,
	235000UL,
	325000UL,
	430000UL,
	550000UL,
	685000UL,
	835000UL,
	1000000UL,
	1500000UL,
	2100000UL,
	2800000UL,
	3600000UL,
	4500000UL,
	6500000UL,
	8000000UL,
	10000000UL,
	42000000UL
};

// INTERNATIONAL_VERSION ±æµå°æÇèÄ¡
const DWORD guild_exp_table2[GUILD_MAX_LEVEL+1] =
{
	0,
	6000UL,
	18000UL,
	36000UL,
	64000UL,
	94000UL,
	130000UL,
	172000UL,
	220000UL,
	274000UL,
	334000UL,
	400000UL,
	600000UL,
	840000UL,
	1120000UL,
	1440000UL,
	1800000UL,
	2600000UL,
	3200000UL,
	4000000UL,
	16800000UL
};
// END_OF_INTERNATIONAL_VERSION ±æµå°æÇèÄ¡

const int aiMobEnchantApplyIdx[MOB_ENCHANTS_MAX_NUM] =
{
	APPLY_CURSE_PCT,
	APPLY_SLOW_PCT,
	APPLY_POISON_PCT,
	APPLY_STUN_PCT,
	APPLY_CRITICAL_PCT,
	APPLY_PENETRATE_PCT,
#if defined(ENABLE_WOLFMAN_CHARACTER) && !defined(USE_MOB_BLEEDING_AS_POISON)
	APPLY_BLEEDING_PCT,
#endif
};

const int aiMobResistsApplyIdx[MOB_RESISTS_MAX_NUM] =
{
	APPLY_RESIST_SWORD,
	APPLY_RESIST_TWOHAND,
	APPLY_RESIST_DAGGER,
	APPLY_RESIST_BELL,
	APPLY_RESIST_FAN,
	APPLY_RESIST_BOW,
	APPLY_RESIST_FIRE,
	APPLY_RESIST_ELEC,
	APPLY_RESIST_MAGIC,
	APPLY_RESIST_WIND,
	APPLY_POISON_REDUCE,
#if defined(ENABLE_WOLFMAN_CHARACTER) && !defined(USE_MOB_CLAW_AS_DAGGER)
	APPLY_RESIST_CLAW,
#endif
#if defined(ENABLE_WOLFMAN_CHARACTER) && !defined(USE_MOB_BLEEDING_AS_POISON)
	APPLY_BLEEDING_REDUCE,
#endif
};

const int aiSocketPercentByQty[5][4] =
{
	{  0,  0,  0,  0 },
	{  3,  0,  0,  0 },
	{ 10,  1,  0,  0 },
	{ 15, 10,  1,  0 },
	{ 20, 15, 10,  1 }
};

const int aiWeaponSocketQty[WEAPON_NUM_TYPES] =
{
	4, // WEAPON_SWORD,
	4, // WEAPON_DAGGER,
	4, // WEAPON_BOW,
	4, // WEAPON_TWO_HANDED,
	4, // WEAPON_BELL,
	4, // WEAPON_FAN,
	0, // WEAPON_ARROW,
	0, // WEAPON_MOUNT_SPEAR
#ifdef ENABLE_WOLFMAN_CHARACTER
	4, // WEAPON_CLAW
#endif
	0,
};

const int aiArmorSocketQty[ARMOR_NUM_TYPES] =
{
	4, // ARMOR_BODY,
	1, // ARMOR_HEAD,
	1, // ARMOR_SHIELD,
	0, // ARMOR_WRIST,
	0, // ARMOR_FOOTS,
	0  // ARMOR_ACCESSORY
};

TItemAttrMap g_map_itemAttr;
TItemAttrMap g_map_itemRare;
TItemAttrMap g_map_itemCostume;
TItemAttrMap g_map_itemCostumeHair;
TItemAttrMap g_map_itemRingsAttr;
TItemAttrMap g_map_itemRingsRare;
#ifdef ENABLE_YOHARA_SYSTEM
TSungmaMap g_map_SungmaTable;
#endif

#ifdef ENABLE_YOHARA_SYSTEM
/* https://fr-wiki.metin2.gameforge.com/index.php/Talisman_volont%C3%A9_STR */
const std::vector<TRandomJewelry> aiItemApplyRandomTalisman =
{
	// SungMa
	{ 0, { 1, 1, 2, 2 } },	//1-2
	{ 1, { 1, 2, 3, 3 } },	//1-3
	{ 2, { 3, 3, 4, 4 } },	//3-4
	{ 3, { 5, 5, 6, 6 } },	//5-6
	{ 4, { 7, 7, 8, 8 } },	//7-8
	{ 5, { 9, 9, 10, 10 } },	//9-10
	{ 6, { 11, 11, 12, 12 } },	//11-12
	{ 7, { 14, 14, 15, 16 } },	//14-16
	{ 8, { 17, 17, 18, 19 } },	//17-19
	{ 9, { 21, 22, 23, 24 } },	//21-24

	// Element
	{ 10, { 1, 1, 2, 2 } },	//1-2
	{ 11, { 2, 2, 3, 3 } },	//2-3
	{ 12, { 3, 3, 4, 4 } },	//3-4
	{ 13, { 4, 4, 5, 5 } },	//4-5
	{ 14, { 5, 5, 6, 6 } },	//5-6
	{ 15, { 6, 6, 7, 7 } },	//6-7
	{ 16, { 7, 7, 8, 8 } },	//7-8
	{ 17, { 8, 8, 8, 9 } },	//8-9
	{ 18, { 9, 9, 9, 10 } },	//9-10
	{ 19, { 15, 15, 16, 17 } },	//15-17
};

const std::vector<TRandomMysterious> aiItemApplyRandomMysterious =
{
	// Element Mistery
	{ 0, { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30 } },		//1-30
	{ 1, { 1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31 } },		//1-31
	{ 2, { 2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32 } },		//2-32
	{ 3, { 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33 } },	//3-33
	{ 4, { 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34 } },	//4-34
	{ 5, { 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 36 } },	//5-36
	{ 6, { 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 55, 56, 57, 58, 59 } },//6-59
	{ 7, { 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 60, 61, 62 } },//7-62
	{ 8, { 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65 } },//8-65
	{ 9, { 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 66, 69 } },//9-69
};

/* https://fr-wiki.metin2.gameforge.com/index.php/B._oreille_jad%C3%A9._nac. */
const std::vector<TRandomJewelry> aiItemApplyRandomJewelry =
{
	// hit_pct
	{ 0, { 1, 1, 2, 2 } },	//1-2
	{ 1, { 2, 2, 3, 3 } },	//2-3
	{ 2, { 3, 3, 4, 4 } },	//3-4
	{ 3, { 4, 4, 5, 5 } },	//4-5
	{ 4, { 5, 5, 6, 6 } },	//5-6
	{ 5, { 6, 6, 7, 7 } },	//6-7
	{ 6, { 7, 7, 8, 8 } },	//7-8
	{ 7, { 8, 8, 9, 10 } },	//8-10
	{ 8, { 9, 9, 10, 11 } },	//9-11
	{ 9, { 10, 11, 12, 14 } },	//10-14

	// Sungma
	{ 10, { 1, 1, 2, 2 } },	//1-2
	{ 11, { 3, 3, 4, 4 } },	//3-4
	{ 12, { 5, 5, 6, 6 } },	//5-6
	{ 13, { 7, 7, 8, 8 } },	//7-8
	{ 14, { 9, 9, 10, 10 } },	//9-10
	{ 15, { 11, 11, 12, 12 } },	//11-12
	{ 16, { 13, 13, 14, 14 } },	//13-14
	{ 17, { 15, 15, 16, 17 } },	//15-17
	{ 18, { 18, 18, 19, 20 } },	//18-20
	{ 19, { 21, 22, 23, 24 } },	//21-24
};

/* https://fr-wiki.metin2.gameforge.com/index.php/Gants */
const std::vector<TRandomGloveInfo> aiItemApplyRandomGlove =
{
	// level(+0,+1, ..., +9) - RandomValue{0, 1, 2, 3, 4}
	{ 0, { 3, 4, 5, 6, 7 } },
	{ 1, { 5, 6, 8, 9, 11 } },
	{ 2, { 9, 12, 14, 15, 17 } },
	{ 3, { 14, 18, 20, 21, 22 } },
	{ 4, { 19, 24, 26, 27, 28 } },
	{ 5, { 24, 30, 32, 33, 34 } },
	{ 6, { 29, 36, 38, 39, 40 } },
	{ 7, { 34, 42, 44, 45, 46 } },
	{ 8, { 39, 48, 50, 51, 52 } },
	{ 9, { 58, 59, 60, 61, 63 } },
};

const std::vector<TRandomSnakeGloveInfo> aiItemApplyRandomSnakeGlove =
{
	// level(+0,+1, ..., +9) - RandomValue{0, 1, 2, 3, 4}
	{ 0, { 6, 7, 8, 9 } },
	{ 1, { 10, 11, 12, 13 } },
	{ 2, { 14, 16, 17, 19 } },
	{ 3, { 19, 21, 23, 25 } },
	{ 4, { 24, 26, 28, 31 } },
	{ 5, { 30, 33, 36, 38 } },
	{ 6, { 36, 39, 42, 44 } },
	{ 7, { 42, 45, 48, 50 } },
	{ 8, { 49, 52, 55, 58 } },
	{ 9, { 69, 72, 75, 78 } },
};

const std::vector<TRandomSnakeArmorInfo> aiItemApplyRandomSnakeArmor =
{
	//---------------| 1. Bonislot |---------------
	{ APPLY_MAX_HP,	// Max. TP
		{
			{ 1550, 1575, 1600, 1650, 1775 },	// +0
			{ 1800, 1825, 1850, 1875, 1975 },	// +1
			{ 2050, 2075, 2100, 2125, 2175 },	// +2
			{ 2300, 2325, 2350, 2375, 2450 },	// +3
			{ 2550, 2575, 2600, 2625, 2675 },	// +4
			{ 2800, 2825, 2850, 2875, 2925 },	// +5
			{ 3050, 3075, 3100, 3125, 3175 },	// +6
			{ 3300, 3325, 3350, 3375, 3425 },	// +7
			{ 3550, 3575, 3600, 3625, 3675 },	// +8
			{ 3800, 3825, 3850, 3875, 4400 },	// +9
			{ 4050, 4075, 4100, 4125, 4600 },	// +10
			{ 4300, 4325, 4350, 4375, 4750 },	// +11
			{ 4550, 4575, 4600, 4625, 5100 },	// +12
			{ 5000, 5025, 5050, 5075, 5250 },	// +13
			{ 5500, 5525, 5550, 5600, 5800 },	// +14
			{ 6000, 6125, 6250, 6375, 6500 },	// +15
		},
	},

	{ APPLY_SKILL_DEFEND_BONUS,	// Widerstand gegen Fertigkeitsschaden
		{
			{ 1, 1, 1, 1, 1 },		// +0
			{ 1, 1, 1, 2, 2 },		// +1
			{ 2, 2, 2, 2, 3 },		// +2
			{ 2, 2, 3, 3, 3 },		// +3
			{ 3, 3, 3, 4, 4 },		// +4
			{ 4, 4, 4, 5, 5 },		// +5
			{ 5, 5, 5, 6, 6 },		// +6
			{ 6, 6, 6, 7, 7 },		// +7
			{ 7, 7, 7, 7, 8 },		// +8
			{ 8, 8, 8, 9, 9 },		// +9
			{ 9, 9, 9, 10, 10 },	// +10
			{ 10, 10, 10, 11, 11 },	// +11
			{ 11, 11, 11, 12, 12 },	// +12
			{ 12, 12, 12, 13, 13 },	// +13
			{ 13, 13, 13, 14, 14 },	// +14
			{ 15, 15, 16, 17, 18 },	// +15
		},
	},

	{ APPLY_NORMAL_HIT_DEFEND_BONUS,	// Durchschn. Schadenswiderstand
		{
			{ 1, 1, 1, 1, 1 },		// +0
			{ 1, 1, 1, 2, 2 },		// +1
			{ 2, 2, 2, 2, 3 },		// +2
			{ 2, 2, 2, 3, 3 },		// +3
			{ 3, 3, 3, 4, 4 },		// +4
			{ 4, 4, 4, 5, 5 },		// +5
			{ 5, 5, 5, 6, 6 },		// +6
			{ 6, 6, 6, 7, 7 },		// +7
			{ 7, 7, 7, 7, 8 },		// +8
			{ 8, 8, 8, 9, 9 },		// +9
			{ 9, 9, 9, 10, 10 },	// +10
			{ 10, 10, 10, 11, 11 },	// +11
			{ 11, 11, 11, 12, 12 },	// +12
			{ 12, 12, 12, 13, 13 },	// +13
			{ 13, 13, 13, 14, 14 },	// +14
			{ 15, 15, 16, 17, 18 },	// +15
		},
	},

	{ APPLY_KILL_HP_RECOVER,	// Chance, TP wiederherzustellen
		{
			{ 1, 1, 1, 2, 2 },		// +0
			{ 1, 2, 2, 3, 3 },		// +1
			{ 2, 2, 3, 4, 4 },		// +2
			{ 2, 3, 4, 5, 5 },		// +3
			{ 3, 3, 4, 6, 6 },		// +4
			{ 4, 4, 5, 7, 7 },		// +5
			{ 5, 5, 6, 8, 8 },		// +6
			{ 6, 6, 7, 9, 9 },		// +7
			{ 7, 7, 8, 9, 10 },		// +8
			{ 8, 9, 10, 11, 13 },	// +9
			{ 9, 10, 12, 13, 14 },	// +10
			{ 10, 11, 13, 14, 15 },	// +11
			{ 11, 12, 14, 15, 16 },	// +12
			{ 12, 13, 15, 16, 17 },	// +13
			{ 13, 14, 16, 17, 18 },	// +14
			{ 15, 17, 18, 20, 25 },	// +15
		},
	},

	#ifdef ENABLE_WOLFMAN_CHARACTER
	{ APPLY_BLEEDING_REDUCE,	// Widerstand gegen Blutungsangriff
	#else
	{ APPLY_ATTBONUS_ZODIAC,
	#endif
		{
			{ 1, 1, 1, 2, 2 },		// +0
			{ 1, 2, 2, 3, 3 },		// +1
			{ 2, 2, 3, 4, 4 },		// +2
			{ 2, 3, 4, 5, 5 },		// +3
			{ 3, 4, 5, 6, 6 },		// +4
			{ 4, 5, 6, 7, 7 },		// +5
			{ 5, 5, 7, 8, 8 },		// +6
			{ 6, 6, 8, 9, 9 },		// +7
			{ 7, 7, 8, 9, 10 },		// +8
			{ 8, 9, 10, 11, 13 },	// +9
			{ 9, 10, 12, 13, 14 },	// +10
			{ 10, 11, 13, 14, 15 },	// +11
			{ 11, 12, 14, 15, 16 },	// +12
			{ 12, 13, 15, 16, 17 },	// +13
			{ 13, 14, 16, 17, 18 },	// +14
			{ 15, 17, 18, 20, 25 },	// +15
		},
	},

	{ APPLY_POISON_REDUCE,	// Giftwiderstand
		{
			{ 1, 1, 1, 2, 2 },		// +0
			{ 1, 2, 2, 3, 3 },		// +1
			{ 2, 2, 3, 4, 4 },		// +2
			{ 2, 3, 4, 5, 5 },		// +3
			{ 3, 4, 5, 6, 6 },		// +4
			{ 4, 5, 6, 7, 7 },		// +5
			{ 5, 5, 7, 8, 8 },		// +6
			{ 6, 6, 8, 9, 9 },		// +7
			{ 7, 7, 8, 9, 10 },		// +8
			{ 8, 9, 10, 11, 13 },	// +9
			{ 9, 10, 12, 13, 14 },	// +10
			{ 10, 11, 13, 14, 15 },	// +11
			{ 11, 12, 14, 15, 16 },	// +12
			{ 12, 13, 15, 16, 17 },	// +13
			{ 13, 14, 16, 17, 18 },	// +14
			{ 15, 17, 18, 20, 25 },	// +15
		},
	},

	{ APPLY_RESIST_MOUNT_FALL,	// Widerstand gegen Sturz
		{
			{ 1, 1, 2, 3, 3 },		// +0
			{ 1, 2, 3, 4, 4 },		// +1
			{ 2, 2, 4, 5, 5 },		// +2
			{ 2, 3, 5, 6, 6 },		// +3
			{ 3, 4, 6, 7, 7 },		// +4
			{ 4, 4, 6, 8, 8 },		// +5
			{ 5, 6, 7, 9, 9 },		// +6
			{ 6, 7, 8, 10, 10 },	// +7
			{ 7, 8, 9, 10, 11 },	// +8
			{ 8, 9, 12, 14, 15 },	// +9
			{ 9, 10, 11, 15, 16 },	// +10
			{ 10, 11, 13, 16, 17 },	// +11
			{ 11, 12, 14, 17, 18 },	// +12
			{ 12, 12, 14, 18, 19 },	// +13
			{ 13, 14, 15, 19, 20 },	// +14
			{ 15, 18, 20, 25, 30 },	// +15
		},
	},

	//---------------| 2. Bonislot |---------------
	{ APPLY_SUNGMA_STR,	// SungMa-Wille (STR)
		{
			{ 2, 3, 4, 5, 6 },		// +0
			{ 4, 5, 6, 7, 8 },		// +1
			{ 6, 7, 8, 9, 10 },		// +2
			{ 8, 9, 10, 11, 12 },	// +3
			{ 10, 11, 12, 13, 14 },	// +4
			{ 12, 13, 14, 15, 16 },	// +5
			{ 14, 15, 16, 17, 19 },	// +6
			{ 16, 17, 18, 19, 21 },	// +7
			{ 18, 19, 20, 21, 23 },	// +8
			{ 21, 22, 23, 24, 26 },	// +9
			{ 23, 24, 25, 26, 29 },	// +10
			{ 25, 26, 27, 29, 31 },	// +11
			{ 27, 28, 29, 31, 33 },	// +12
			{ 30, 31, 32, 33, 36 },	// +13
			{ 33, 34, 35, 36, 39 },	// +14
			{ 40, 42, 44, 45, 47 },	// +15
		},
	},

	{ APPLY_SUNGMA_MOVE,	// SungMa-Wille (RES)
		{
			{ 2, 3, 4, 5, 6 },		// +0
			{ 4, 5, 6, 7, 8 },		// +1
			{ 6, 7, 8, 9, 10 },		// +2
			{ 8, 9, 10, 11, 12 },	// +3
			{ 10, 11, 12, 13, 14 },	// +4
			{ 12, 13, 14, 15, 16 },	// +5
			{ 14, 15, 16, 17, 19 },	// +6
			{ 16, 17, 18, 19, 21 },	// +7
			{ 18, 19, 20, 21, 23 },	// +8
			{ 21, 22, 23, 24, 26 },	// +9
			{ 23, 24, 25, 26, 29 },	// +10
			{ 25, 26, 27, 29, 31 },	// +11
			{ 27, 28, 29, 31, 33 },	// +12
			{ 30, 31, 32, 33, 36 },	// +13
			{ 33, 34, 35, 36, 39 },	// +14
			{ 40, 42, 44, 45, 47 },	// +15
		},
	},

	{ APPLY_SUNGMA_HP,	// SungMa-Wille (VIT)
		{
			{ 2, 3, 4, 5, 6 },		// +0
			{ 4, 5, 6, 7, 8 },		// +1
			{ 6, 7, 8, 9, 10 },		// +2
			{ 8, 9, 10, 11, 12 },	// +3
			{ 10, 11, 12, 13, 14 },	// +4
			{ 12, 13, 14, 15, 16 },	// +5
			{ 14, 15, 16, 17, 19 },	// +6
			{ 16, 17, 18, 19, 21 },	// +7
			{ 18, 19, 20, 21, 23 },	// +8
			{ 21, 22, 23, 24, 26 },	// +9
			{ 23, 24, 25, 26, 29 },	// +10
			{ 25, 26, 27, 29, 31 },	// +11
			{ 27, 28, 29, 31, 33 },	// +12
			{ 30, 31, 32, 33, 36 },	// +13
			{ 33, 34, 35, 36, 39 },	// +14
			{ 40, 42, 44, 45, 47 },	// +15
		},
	},

	{ APPLY_SUNGMA_IMMUNE,	// SungMa-Wille (INT)
		{
			{ 2, 3, 4, 5, 6 },		// +0
			{ 4, 5, 6, 7, 8 },		// +1
			{ 6, 7, 8, 9, 10 },		// +2
			{ 8, 9, 10, 11, 12 },	// +3
			{ 10, 11, 12, 13, 14 },	// +4
			{ 12, 13, 14, 15, 16 },	// +5
			{ 14, 15, 16, 17, 19 },	// +6
			{ 16, 17, 18, 19, 21 },	// +7
			{ 18, 19, 20, 21, 23 },	// +8
			{ 21, 22, 23, 24, 26 },	// +9
			{ 23, 24, 25, 26, 29 },	// +10
			{ 25, 26, 27, 29, 31 },	// +11
			{ 27, 28, 29, 31, 33 },	// +12
			{ 30, 31, 32, 33, 36 },	// +13
			{ 33, 34, 35, 36, 39 },	// +14
			{ 40, 42, 44, 45, 47 },	// +15
		},
	},

	//---------------| 3. Bonislot |---------------
	{ APPLY_MONSTER_DEFEND_BONUS,	// Widerstand gegen Monster-Angriffe
		{
			{ 1, 1, 1, 1, 1 },		// +0
			{ 1, 1, 1, 2, 2 },		// +1
			{ 2, 2, 2, 3, 3 },		// +2
			{ 2, 2, 2, 3, 3 },		// +3
			{ 3, 3, 3, 4, 4 },		// +4
			{ 4, 4, 4, 5, 5 },		// +5
			{ 5, 5, 5, 6, 6 },		// +6
			{ 6, 6, 6, 7, 7 },		// +7
			{ 7, 7, 7, 7, 8 },		// +8
			{ 8, 8, 8, 8, 9 },		// +9
			{ 9, 9, 9, 9, 10 },		// +10
			{ 10, 10, 10, 10, 11 },	// +11
			{ 11, 11, 11, 11, 12 },	// +12
			{ 12, 12, 12, 12, 13 },	// +13
			{ 13, 13, 13, 13, 14 },	// +14
			{ 15, 16, 16, 17, 18 },	// +15
		},
	},

	{ APPLY_ATTBONUS_MONSTER,	// Stark gegen Monster
		{
			{ 1, 1, 1, 2, 2 },		// +0
			{ 1, 1, 1, 2, 2 },		// +1
			{ 2, 2, 2, 3, 3 },		// +2
			{ 2, 2, 3, 3, 3 },		// +3
			{ 3, 3, 3, 4, 4 },		// +4
			{ 4, 4, 4, 5, 5 },		// +5
			{ 5, 5, 5, 6, 6 },		// +6
			{ 6, 6, 6, 7, 7 },		// +7
			{ 7, 7, 7, 7, 8 },		// +8
			{ 8, 8, 8, 8, 9 },		// +9
			{ 9, 9, 9, 9, 10 },	// +10
			{ 10, 10, 10, 10, 11 },	// +11
			{ 11, 11, 11, 11, 12 },	// +12
			{ 12, 12, 12, 12, 13 },	// +13
			{ 13, 13, 13, 13, 14 },	// +14
			{ 15, 15, 16, 17, 18 },	// +15
		},
	},

	{ APPLY_STEAL_HP,	// Schaden wird von TP absorbiert
		{
			{ 1, 1, 1, 2, 2 },		// +0
			{ 2, 2, 2, 3, 3 },		// +1
			{ 3, 3, 3, 4, 4 },		// +2
			{ 3, 3, 3, 4, 4 },		// +3
			{ 3, 4, 5, 6, 6 },		// +4
			{ 5, 5, 6, 7, 7 },		// +5
			{ 6, 6, 7, 8, 8 },		// +6
			{ 7, 7, 8, 9, 9 },		// +7
			{ 8, 8, 9, 9, 10 },		// +8
			{ 9, 9, 10, 11, 13 },	// +9
			{ 10, 10, 11, 12, 14 },	// +10
			{ 11, 11, 12, 13, 15 },	// +11
			{ 12, 13, 14, 15, 16 },	// +12
			{ 12, 14, 15, 16, 17 },	// +13
			{ 14, 15, 16, 17, 18 },	// +14
			{ 16, 17, 18, 20, 25 },	// +15
		},
	},

	{ APPLY_STEAL_SP,	// Schaden wird von SP absorbiert
		{
			{ 1, 1, 1, 2, 2 },		// +0
			{ 2, 2, 2, 3, 3 },		// +1
			{ 3, 3, 3, 4, 4 },		// +2
			{ 3, 3, 3, 4, 4 },		// +3
			{ 3, 4, 5, 6, 6 },		// +4
			{ 5, 5, 6, 7, 7 },		// +5
			{ 6, 6, 7, 8, 8 },		// +6
			{ 7, 7, 8, 9, 9 },		// +7
			{ 8, 8, 9, 9, 10 },		// +8
			{ 9, 9, 10, 11, 13 },	// +9
			{ 10, 10, 11, 12, 14 },	// +10
			{ 11, 11, 12, 13, 15 },	// +11
			{ 12, 13, 14, 15, 16 },	// +12
			{ 12, 14, 15, 16, 17 },	// +13
			{ 14, 15, 16, 17, 18 },	// +14
			{ 16, 17, 18, 20, 25 },	// +15
		},
	},

	{ APPLY_RESIST_MAGIC,	// Magiewiderstand
		{
			{ 1, 1, 2, 3, 3 },		// +0
			{ 1, 1, 2, 3, 3 },		// +1
			{ 2, 2, 3, 4, 4 },		// +2
			{ 2, 2, 3, 4, 4 },		// +3
			{ 3, 4, 5, 6, 6 },		// +4
			{ 4, 5, 6, 7, 7 },		// +5
			{ 5, 6, 7, 9, 9 },		// +6
			{ 6, 7, 8, 10, 10 },	// +7
			{ 7, 8, 9, 10, 11 },	// +8
			{ 8, 9, 10, 11, 12 },	// +9
			{ 9, 11, 12, 14, 16 },	// +10
			{ 10, 12, 13, 15, 17 },	// +11
			{ 11, 14, 15, 16, 18 },	// +12
			{ 12, 15, 16, 17, 19 },	// +13
			{ 13, 16, 17, 18, 20 },	// +14
			{ 15, 18, 20, 25, 30 },	// +15
		},
	},

	{ APPLY_MOV_SPEED,	// Bewegungsgeschwindigkeit
		{
			{ -15, -12, -10, -9, -6 },		// +0
			{ -12, -10, -8, -6, -4 },		// +1
			{ -10, -8, -6, -4, -2 },		// +2
			{ -9, -7, -5, -3, -1 },			// +3
			{ -6, -4, -3, -1, 1 },			// +4
			{ -4, -3, -1, 1, 2 },			// +5
			{ -2, -1, 1, 2, 3 },			// +6
			{ -1, 1, 2, 3, 4 },				// +7
			{ 1, 2, 3, 4, 5 },				// +8
			{ 2, 3, 4, 5, 6 },				// +9
			{ 3, 4, 5, 6, 7 },				// +10
			{ 4, 5, 6, 7, 8 },				// +11
			{ 5, 6, 7, 8, 9 },				// +12
			{ 6, 7, 8, 9, 10 },				// +13
			{ 10, 12, 14, 17, 20 },			// +14
			{ 12, 15, 18, 20, 25 },			// +15
		},
	},
};

const std::vector<TRandomSnakeWeaponInfo> aiItemApplyRandomSnakeWeapon =
{
	//---------------| 1. Bonislot |---------------
	{ APPLY_NORMAL_HIT_DAMAGE_BONUS,	// Durchschnittsschaden
		{
			{ 2, 3, 4 },	// +0
			{ 3, 4, 6 },	// +1
			{ 4, 6, 7 },	// +2
			{ 5, 7, 8 },	// +3
			{ 6, 8, 9 },	// +4
			{ 7, 9, 10 },	// +5
			{ 8, 10, 11 },	// +6
			{ 9, 11, 13 },	// +7
			{ 10, 13, 16 },	// +8
			{ 13, 15, 19 },	// +9
			{ 14, 16, 22 },	// +10
			{ 15, 20, 25 },	// +11
			{ 16, 22, 28 },	// +12
			{ 17, 24, 31 },	// +13
			{ 18, 25, 34 },	// +14
			{ 25, 30, 40 },	// +15
		},
	},

	{ APPLY_ATTBONUS_HUMAN,	// Stark gegen Halbmenschen
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	{ APPLY_ATTBONUS_DEVIL,	// Stark gegen Teufel
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	{ APPLY_ATTBONUS_ANIMAL,	// Stark gegen Tiere
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	{ APPLY_ATTBONUS_UNDEAD,	// Stark gegen Untote
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	{ APPLY_ATTBONUS_ORC,	// Stark gegen Orks
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	{ APPLY_ATTBONUS_MILGYO,	// Stark gegen Esoterische
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},


	//---------------| 2. Bonislot |---------------
	{ APPLY_SUNGMA_STR,	// SungMa-Wille (STR)
		{
			{ 2, 4, 6 },	// +0
			{ 4, 6, 8 },	// +1
			{ 6, 8, 10 },	// +2
			{ 8, 10, 12 },	// +3
			{ 10, 12, 14 },	// +4
			{ 12, 14, 16 },	// +5
			{ 14, 17, 19 },	// +6
			{ 16, 19, 21 },	// +7
			{ 18, 21, 23 },	// +8
			{ 21, 23, 26 },	// +9
			{ 23, 26, 29 },	// +10
			{ 25, 29, 31 },	// +11
			{ 27, 31, 33 },	// +12
			{ 30, 33, 36 },	// +13
			{ 33, 36, 39 },	// +14
			{ 40, 43, 47 },	// +15
		},
	},

	{ APPLY_SUNGMA_MOVE,	// SungMa-Wille (RES)
		{
			{ 2, 4, 6 },	// +0
			{ 4, 6, 8 },	// +1
			{ 6, 8, 10 },	// +2
			{ 8, 10, 12 },	// +3
			{ 10, 12, 14 },	// +4
			{ 12, 14, 16 },	// +5
			{ 14, 17, 19 },	// +6
			{ 16, 19, 21 },	// +7
			{ 18, 21, 23 },	// +8
			{ 21, 23, 26 },	// +9
			{ 23, 26, 29 },	// +10
			{ 25, 29, 31 },	// +11
			{ 27, 31, 33 },	// +12
			{ 30, 33, 36 },	// +13
			{ 33, 36, 39 },	// +14
			{ 40, 43, 47 },	// +15
		},
	},

	{ APPLY_SUNGMA_HP,	// SungMa-Wille (VIT)
		{
			{ 2, 4, 6 },	// +0
			{ 4, 6, 8 },	// +1
			{ 6, 8, 10 },	// +2
			{ 8, 10, 12 },	// +3
			{ 10, 12, 14 },	// +4
			{ 12, 14, 16 },	// +5
			{ 14, 17, 19 },	// +6
			{ 16, 19, 21 },	// +7
			{ 18, 21, 23 },	// +8
			{ 21, 23, 26 },	// +9
			{ 23, 26, 29 },	// +10
			{ 25, 29, 31 },	// +11
			{ 27, 31, 33 },	// +12
			{ 30, 33, 36 },	// +13
			{ 33, 36, 39 },	// +14
			{ 40, 43, 47 },	// +15
		},
	},

	{ APPLY_SUNGMA_IMMUNE,	// SungMa-Wille (INT)
		{
			{ 2, 4, 6 },	// +0
			{ 4, 6, 8 },	// +1
			{ 6, 8, 10 },	// +2
			{ 8, 10, 12 },	// +3
			{ 10, 12, 14 },	// +4
			{ 12, 14, 16 },	// +5
			{ 14, 17, 19 },	// +6
			{ 16, 19, 21 },	// +7
			{ 18, 21, 23 },	// +8
			{ 21, 23, 26 },	// +9
			{ 23, 26, 29 },	// +10
			{ 25, 29, 31 },	// +11
			{ 27, 31, 33 },	// +12
			{ 30, 33, 36 },	// +13
			{ 33, 36, 39 },	// +14
			{ 40, 43, 47 },	// +15
		},
	},

	{ APPLY_ATT_SPEED,	// Angriffsgeschwindigkeit
		{
			{ 13, 14, 16 },	// +0
			{ 13, 14, 17 },	// +1
			{ 14, 15, 18 },	// +2
			{ 14, 16, 19 },	// +3
			{ 15, 17, 20 },	// +4
			{ 16, 18, 21 },	// +5
			{ 17, 19, 22 },	// +6
			{ 18, 20, 23 },	// +7
			{ 19, 21, 24 },	// +8
			{ 20, 23, 26 },	// +9
			{ 21, 24, 27 },	// +10
			{ 22, 25, 28 },	// +11
			{ 23, 26, 29 },	// +12
			{ 24, 27, 30 },	// +13
			{ 25, 28, 32 },	// +14
			{ 30, 38, 45 },	// +15
		},
	},

	{ APPLY_ATTBONUS_MONSTER,	// Stark gegen Monster
		{
			{ 1, 1, 2 },	// +0
			{ 1, 2, 3 },	// +1
			{ 2, 3, 4 },	// +2
			{ 2, 4, 5 },	// +3
			{ 3, 5, 6 },	// +4
			{ 4, 6, 7 },	// +5
			{ 5, 7, 8 },	// +6
			{ 6, 8, 9 },	// +7
			{ 7, 9, 10 },	// +8
			{ 8, 12, 13 },	// +9
			{ 9, 13, 14 },	// +10
			{ 10, 14, 15 },	// +11
			{ 11, 15, 16 },	// +12
			{ 12, 16, 17 },	// +13
			{ 13, 17, 18 },	// +14
			{ 15, 20, 25 },	// +15
		},
	},

	{ APPLY_ATTBONUS_INSECT,	// Stark gegen Insekten
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	{ APPLY_ATTBONUS_ZODIAC,	// Stark gegen Zodiakmonster
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 22, 30 },	// +15
		},
	},

	//---------------| 3. Bonislot |---------------
	{ APPLY_SKILL_DAMAGE_BONUS,	// Fertigkeitsschaden
		{
			{ 2, 3, 4 },	// +0
			{ 3, 4, 6 },	// +1
			{ 4, 6, 7 },	// +2
			{ 5, 7, 8 },	// +3
			{ 6, 8, 9 },	// +4
			{ 7, 9, 10 },	// +5
			{ 8, 10, 11 },	// +6
			{ 9, 11, 13 },	// +7
			{ 10, 13, 16 },	// +8
			{ 13, 15, 19 },	// +9
			{ 14, 16, 22 },	// +10
			{ 15, 20, 25 },	// +11
			{ 16, 22, 28 },	// +12
			{ 17, 24, 31 },	// +13
			{ 18, 25, 34 },	// +14
			{ 25, 30, 40 },	// +15
		},
	},

	{ APPLY_ATTBONUS_STONE,	// Stark gegen Metinsteine
		{
			{ 1, 1, 1 },	// +0
			{ 1, 1, 2 },	// +1
			{ 2, 2, 3 },	// +2
			{ 2, 2, 3 },	// +3
			{ 3, 3, 4 },	// +4
			{ 4, 4, 5 },	// +5
			{ 5, 5, 6 },	// +6
			{ 6, 6, 7 },	// +7
			{ 7, 7, 8 },	// +8
			{ 8, 8, 9 },	// +9
			{ 9, 9, 10 },	// +10
			{ 10, 10, 11 },	// +11
			{ 11, 11, 12 },	// +12
			{ 12, 12, 13 },	// +13
			{ 13, 13, 14 },	// +14
			{ 15, 16, 18 },	// +15
		},
	},

	{ APPLY_ATTBONUS_DESERT,	// Stark gegen W?tenmonster
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 20, 30 },	// +15
		},
	},

	{ APPLY_CAST_SPEED,	// Zaubergeschwindigkeit
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 20, 30 },	// +15
		},
	},

	{ APPLY_EXP_DOUBLE_BONUS,	// Chance auf EXP-Bonus
		{
			{ 1, 2, 3 },	// +0
			{ 1, 2, 4 },	// +1
			{ 2, 3, 5 },	// +2
			{ 2, 4, 6 },	// +3
			{ 3, 5, 7 },	// +4
			{ 4, 6, 8 },	// +5
			{ 5, 7, 9 },	// +6
			{ 6, 8, 10 },	// +7
			{ 7, 9, 11 },	// +8
			{ 8, 11, 15 },	// +9
			{ 9, 12, 16 },	// +10
			{ 10, 13, 17 },	// +11
			{ 11, 14, 18 },	// +12
			{ 12, 15, 19 },	// +13
			{ 13, 16, 20 },	// +14
			{ 15, 20, 30 },	// +15
		},
	},

	{ APPLY_MANA_BURN_PCT,	// Chance auf Manaraub
		{
			{ 1, 1, 2 },	// +0
			{ 1, 2, 3 },	// +1
			{ 2, 3, 4 },	// +2
			{ 2, 4, 5 },	// +3
			{ 3, 5, 6 },	// +4
			{ 4, 6, 7 },	// +5
			{ 5, 7, 8 },	// +6
			{ 6, 8, 9 },	// +7
			{ 7, 9, 10 },	// +8
			{ 8, 11, 13 },	// +9
			{ 9, 12, 14 },	// +10
			{ 10, 13, 15 },	// +11
			{ 11, 14, 16 },	// +12
			{ 12, 15, 17 },	// +13
			{ 13, 16, 18 },	// +14
			{ 15, 20, 25 },	// +15
		},
	},

	{ APPLY_SLOW_PCT,	// Verlangsamungschance
		{
			{ 1, 1, 2 },	// +0
			{ 1, 2, 3 },	// +1
			{ 2, 3, 4 },	// +2
			{ 2, 4, 5 },	// +3
			{ 3, 5, 6 },	// +4
			{ 4, 6, 7 },	// +5
			{ 5, 7, 8 },	// +6
			{ 6, 8, 9 },	// +7
			{ 7, 9, 10 },	// +8
			{ 8, 11, 13 },	// +9
			{ 9, 12, 14 },	// +10
			{ 10, 13, 15 },	// +11
			{ 11, 14, 16 },	// +12
			{ 12, 15, 17 },	// +13
			{ 13, 16, 18 },	// +14
			{ 15, 20, 25 },	// +15
		},
	},

	{ APPLY_STUN_PCT,	// Ohnmachtchance
		{
			{ 1, 1, 2 },	// +0
			{ 1, 2, 3 },	// +1
			{ 2, 3, 4 },	// +2
			{ 2, 4, 5 },	// +3
			{ 3, 5, 6 },	// +4
			{ 4, 6, 7 },	// +5
			{ 5, 7, 8 },	// +6
			{ 6, 8, 9 },	// +7
			{ 7, 9, 10 },	// +8
			{ 8, 11, 13 },	// +9
			{ 9, 12, 14 },	// +10
			{ 10, 13, 15 },	// +11
			{ 11, 14, 16 },	// +12
			{ 12, 15, 17 },	// +13
			{ 13, 16, 18 },	// +14
			{ 15, 20, 25 },	// +15
		},
	},

	{ APPLY_HIT_PCT,	// Pr?ision
		{
			{ 1, 1, 2 },	// +0
			{ 1, 2, 3 },	// +1
			{ 2, 3, 4 },	// +2
			{ 2, 4, 5 },	// +3
			{ 3, 5, 6 },	// +4
			{ 4, 6, 7 },	// +5
			{ 5, 7, 8 },	// +6
			{ 6, 8, 9 },	// +7
			{ 7, 9, 10 },	// +8
			{ 8, 11, 13 },	// +9
			{ 9, 12, 14 },	// +10
			{ 10, 13, 15 },	// +11
			{ 11, 14, 16 },	// +12
			{ 12, 15, 17 },	// +13
			{ 13, 16, 18 },	// +14
			{ 15, 20, 25 },	// +15
		},
	},
};
#endif

#ifdef ENABLE_PRECISION_SKILL
const int aiSkillPrecision[SKILL_MAX_LEVEL + 1] =
{
	0,	// 0
	0,	// 1
	0,	// 2
	1,	// 3
	1,	// 4
	1,	// 5
	2,	// 6
	2,	// 7
	2,	// 8
	3,	// 9
	3,	// 10
	3,	// 11
	4,	// 12
	4,	// 13
	4,	// 14
	5,	// 15
	5,	// 16
	5,	// 17
	6,	// 18
	6,	// 19
	8,	// 20 M1
	8,	// 21
	8,	// 22
	9,	// 23
	9,	// 24
	9,	// 25
	10,	// 26
	10,	// 27
	11,	// 28
	11,	// 29
	13,	// 30 G1
	13,	// 31
	14,	// 32
	14,	// 33
	15,	// 34
	16,	// 35
	16,	// 36
	17,	// 37
	18,	// 38
	18,	// 39
	20,	// 40 P
};
#endif

const TApplyInfo aApplyInfo[MAX_APPLY_NUM] =
/*
{
   DWORD dwPointType;
}
 */
{
	// Point Type
	{ POINT_NONE,			},   // APPLY_NONE,		0
	{ POINT_MAX_HP,		        },   // APPLY_MAX_HP,		1
	{ POINT_MAX_SP,		        },   // APPLY_MAX_SP,		2
	{ POINT_HT,			        },   // APPLY_CON,		3
	{ POINT_IQ,			        },   // APPLY_INT,		4
	{ POINT_ST,			        },   // APPLY_STR,		5
	{ POINT_DX,			        },   // APPLY_DEX,		6
	{ POINT_ATT_SPEED,		        },   // APPLY_ATT_SPEED,	7
	{ POINT_MOV_SPEED,		        },   // APPLY_MOV_SPEED,	8
	{ POINT_CASTING_SPEED,	        },   // APPLY_CAST_SPEED,	9
	{ POINT_HP_REGEN,			},   // APPLY_HP_REGEN,		10
	{ POINT_SP_REGEN,			},   // APPLY_SP_REGEN,		11
	{ POINT_POISON_PCT,		        },   // APPLY_POISON_PCT,	12
	{ POINT_STUN_PCT,		        },   // APPLY_STUN_PCT,		13
	{ POINT_SLOW_PCT,		        },   // APPLY_SLOW_PCT,		14
	{ POINT_CRITICAL_PCT,		},   // APPLY_CRITICAL_PCT,	15
	{ POINT_PENETRATE_PCT,	        },   // APPLY_PENETRATE_PCT,	16
	{ POINT_ATTBONUS_HUMAN,	        },   // APPLY_ATTBONUS_HUMAN,	17
	{ POINT_ATTBONUS_ANIMAL,	        },   // APPLY_ATTBONUS_ANIMAL,	18
	{ POINT_ATTBONUS_ORC,		},   // APPLY_ATTBONUS_ORC,	19
	{ POINT_ATTBONUS_MILGYO,	        },   // APPLY_ATTBONUS_MILGYO,	20
	{ POINT_ATTBONUS_UNDEAD,	        },   // APPLY_ATTBONUS_UNDEAD,	21
	{ POINT_ATTBONUS_DEVIL,	        },   // APPLY_ATTBONUS_DEVIL,	22
	{ POINT_STEAL_HP,		        },   // APPLY_STEAL_HP,		23
	{ POINT_STEAL_SP,		        },   // APPLY_STEAL_SP,		24
	{ POINT_MANA_BURN_PCT,	        },   // APPLY_MANA_BURN_PCT,	25
	{ POINT_DAMAGE_SP_RECOVER,	        },   // APPLY_DAMAGE_SP_RECOVER,26
	{ POINT_BLOCK,		        },   // APPLY_BLOCK,		27
	{ POINT_DODGE,		        },   // APPLY_DODGE,		28
	{ POINT_RESIST_SWORD,		},   // APPLY_RESIST_SWORD,	29
	{ POINT_RESIST_TWOHAND,	        },   // APPLY_RESIST_TWOHAND,	30
	{ POINT_RESIST_DAGGER,	        },   // APPLY_RESIST_DAGGER,	31
	{ POINT_RESIST_BELL,		},   // APPLY_RESIST_BELL,	32
	{ POINT_RESIST_FAN,		        },   // APPLY_RESIST_FAN,	33
	{ POINT_RESIST_BOW,		        },   // APPLY_RESIST_BOW,	34
	{ POINT_RESIST_FIRE,		},   // APPLY_RESIST_FIRE,	35
	{ POINT_RESIST_ELEC,		},   // APPLY_RESIST_ELEC,	36
	{ POINT_RESIST_MAGIC,		},   // APPLY_RESIST_MAGIC,	37
	{ POINT_RESIST_WIND,		},   // APPLY_RESIST_WIND,	38
	{ POINT_REFLECT_MELEE,	        },   // APPLY_REFLECT_MELEE,	39
	{ POINT_REFLECT_CURSE,	        },   // APPLY_REFLECT_CURSE,	40
	{ POINT_POISON_REDUCE,	        },   // APPLY_POISON_REDUCE,	41
	{ POINT_KILL_SP_RECOVER,	        },   // APPLY_KILL_SP_RECOVER,	42
	{ POINT_EXP_DOUBLE_BONUS,	        },   // APPLY_EXP_DOUBLE_BONUS,	43
	{ POINT_GOLD_DOUBLE_BONUS,	        },   // APPLY_GOLD_DOUBLE_BONUS,44
	{ POINT_ITEM_DROP_BONUS,	        },   // APPLY_ITEM_DROP_BONUS,	45
	{ POINT_POTION_BONUS,		},   // APPLY_POTION_BONUS,	46
	{ POINT_KILL_HP_RECOVERY,	        },   // APPLY_KILL_HP_RECOVER,	47
	{ POINT_IMMUNE_STUN,		},   // APPLY_IMMUNE_STUN,	48
	{ POINT_IMMUNE_SLOW,		},   // APPLY_IMMUNE_SLOW,	49
	{ POINT_IMMUNE_FALL,		},   // APPLY_IMMUNE_FALL,	50
	{ POINT_NONE,			},   // APPLY_SKILL,		51
	{ POINT_BOW_DISTANCE,		},   // APPLY_BOW_DISTANCE,	52
	{ POINT_ATT_GRADE_BONUS,	        },   // APPLY_ATT_GRADE,	53
	{ POINT_DEF_GRADE_BONUS,	        },   // APPLY_DEF_GRADE,	54
	{ POINT_MAGIC_ATT_GRADE_BONUS,      },   // APPLY_MAGIC_ATT_GRADE,	55
	{ POINT_MAGIC_DEF_GRADE_BONUS,      },   // APPLY_MAGIC_DEF_GRADE,	56
	{ POINT_CURSE_PCT,			},   // APPLY_CURSE_PCT,	57
	{ POINT_MAX_STAMINA			},   // APPLY_MAX_STAMINA	58
	{ POINT_ATTBONUS_WARRIOR		},   // APPLY_ATTBONUS_WARRIOR  59
	{ POINT_ATTBONUS_ASSASSIN		},   // APPLY_ATTBONUS_ASSASSIN 60
	{ POINT_ATTBONUS_SURA		},   // APPLY_ATTBONUS_SURA     61
	{ POINT_ATTBONUS_SHAMAN		},   // APPLY_ATTBONUS_SHAMAN   62
	{ POINT_ATTBONUS_MONSTER		},   //	APPLY_ATTBONUS_MONSTER  63
	{ POINT_ATT_BONUS		},   // 64 // APPLY_MALL_ATTBONUS
	{ POINT_MALL_DEFBONUS		},   // 65
	{ POINT_MALL_EXPBONUS		},   // 66 APPLY_MALL_EXPBONUS
	{ POINT_MALL_ITEMBONUS		},   // 67
	{ POINT_MALL_GOLDBONUS		},   // 68
	{ POINT_MAX_HP_PCT			},		// 69
	{ POINT_MAX_SP_PCT			},		// 70
	{ POINT_SKILL_DAMAGE_BONUS		},	// 71
	{ POINT_NORMAL_HIT_DAMAGE_BONUS	},	// 72

	// DEFEND_BONUS_ATTRIBUTES
	{ POINT_SKILL_DEFEND_BONUS		},	// 73
	{ POINT_NORMAL_HIT_DEFEND_BONUS	},	// 74
	// END_OF_DEFEND_BONUS_ATTRIBUTES

	// PC_BANG_ITEM_ADD
	{ POINT_PC_BANG_EXP_BONUS	},		// 75
	{ POINT_PC_BANG_DROP_BONUS	},		// 76
	// END_PC_BANG_ITEM_ADD

	{ POINT_NONE,		},				// 77 »ç¿ë½Ã HP ¼Ò¸ð APPLY_EXTRACT_HP_PCT

	{ POINT_RESIST_WARRIOR,		},		// 78 ¹«»ç¿¡°Ô ÀúÇ× APPLY_RESIST_WARRIOR
	{ POINT_RESIST_ASSASSIN,	},		// 79 ÀÚ°´¿¡°Ô ÀúÇ× APPLY_RESIST_ASSASSIN
	{ POINT_RESIST_SURA,		},		// 80 ¼ö¶ó¿¡°Ô ÀúÇ× APPLY_RESIST_SURA
	{ POINT_RESIST_SHAMAN,		},		// 81 ¹«´ç¿¡°Ô ÀúÇ× APPLY_RESIST_SHAMAN
	{ POINT_ENERGY				},		// 82 ±â·Â
	{ POINT_DEF_GRADE			},		// 83 ¹æ¾î·Â. DEF_GRADE_BONUS´Â Å¬¶ó¿¡¼­ µÎ¹è·Î º¸¿©Áö´Â ÀÇµµµÈ ¹ö±×(...)°¡ ÀÖ´Ù.
	{ POINT_COSTUME_ATTR_BONUS	},		// 84 ÄÚ½ºÆ¬¿¡ ºÙÀº ¼Ó¼º¿¡ ´ëÇØ¼­¸¸ º¸³Ê½º¸¦ ÁÖ´Â ±â·Â
	{ POINT_MAGIC_ATT_BONUS_PER },			// 85 ¸¶¹ý °ø°Ý·Â +x%
	{ POINT_MELEE_MAGIC_ATT_BONUS_PER		},			// 86 APPLY_MELEE_MAGIC_ATTBONUS_PER
	{ POINT_RESIST_ICE,			},   // APPLY_RESIST_ICE,	87
	{ POINT_RESIST_EARTH,		},   // APPLY_RESIST_EARTH,	88
	{ POINT_RESIST_DARK,		},   // APPLY_RESIST_DARK,	89
	{ POINT_RESIST_CRITICAL,		},   // APPLY_ANTI_CRITICAL_PCT,	90
	{ POINT_RESIST_PENETRATE,		},   // APPLY_ANTI_PENETRATE_PCT,	91

#ifdef ENABLE_WOLFMAN_CHARACTER
	{ POINT_BLEEDING_REDUCE,		},	// APPLY_BLEEDING_REDUCE, 		92
	{ POINT_BLEEDING_PCT,			},	// APPLY_BLEEDING_PCT, 			93
	{ POINT_ATTBONUS_WOLFMAN,		},	// APPLY_ATTBONUS_WOLFMAN,		94 ¼öÀÎÁ·¿¡°Ô °­ÇÔ
	{ POINT_RESIST_WOLFMAN,			},	// APPLY_RESIST_WOLFMAN,		95 ¼öÀÎÁ·¿¡°Ô ÀúÇ×
	{ POINT_RESIST_CLAW,			},	// APPLY_RESIST_CLAW,			96 CLAW¿¡°Ô ÀúÇ×
#else
	{ POINT_NONE,					},	// APPLY_BLEEDING_REDUCE, 		92
	{ POINT_NONE,					},	// APPLY_BLEEDING_PCT, 			93
	{ POINT_NONE,					},	// APPLY_ATTBONUS_WOLFMAN,		94 ¼öÀÎÁ·¿¡°Ô °­ÇÔ
	{ POINT_NONE,					},	// APPLY_RESIST_WOLFMAN,		95 ¼öÀÎÁ·¿¡°Ô ÀúÇ×
	{ POINT_NONE,					},	// APPLY_RESIST_CLAW,			96 CLAW¿¡°Ô ÀúÇ×
#endif

#ifdef ENABLE_ACCE_COSTUME_SYSTEM
	{ POINT_ACCEDRAIN_RATE,			},	// APPLY_ACCEDRAIN_RATE,		97
#else
	{ POINT_NONE,			},	// APPLY_ACCEDRAIN_RATE,		97
#endif

#ifdef ENABLE_MAGIC_REDUCTION_SYSTEM
	{ POINT_RESIST_MAGIC_REDUCTION,	},	// APPLY_RESIST_MAGIC_REDUCTION,98
#else
	{ POINT_NONE,					},	// APPLY_RESIST_MAGIC_REDUCTION,98
#endif

#ifdef ENABLE_NEW_BONUS_WORLDARD
	{ POINT_RESIST_HUMAN,	},	// POINT_RESIST_HUMAN,99
#else
	{ POINT_NONE,					},	// POINT_RESIST_HUMAN,99
#endif

#ifdef ELEMENT_NEW_BONUSES
	{ POINT_ATTBONUS_ELEC,},
	{ POINT_ATTBONUS_FIRE, },
	{ POINT_ATTBONUS_ICE, },
	{ POINT_ATTBONUS_WIND, },
	{ POINT_ATTBONUS_EARTH, },
	{ POINT_ATTBONUS_DARK, },
#endif

	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
	{ POINT_NONE,					},
#ifdef ENABLE_YOHARA_SYSTEM
	{ POINT_SUNGMA_STR, }, // 119
	{ POINT_SUNGMA_HP, }, //120
	{ POINT_SUNGMA_MOVE, }, //121
	{ POINT_SUNGMA_IMMUNE, }, //122
	//{ POINT_CONQUEROR_POINT, }, //123
#endif
#ifdef ELEMENT_NEW_BONUSES
	{ POINT_ENCHANT_ELEC, }, //100
	{ POINT_ENCHANT_FIRE, }, //101
	{ POINT_ENCHANT_ICE, }, //102
	{ POINT_ENCHANT_WIND, }, //103
	{ POINT_ENCHANT_EARTH, }, //104
	{ POINT_ENCHANT_DARK, }, //105

	{ POINT_ATTBONUS_SWORD, },		
	{ POINT_ATTBONUS_TWOHAND, },	
	{ POINT_ATTBONUS_DAGGER, },	
	{ POINT_ATTBONUS_BELL, },		
	{ POINT_ATTBONUS_FAN, },		
	{ POINT_ATTBONUS_BOW, },

	{ POINT_ATTBONUS_ZODIAC, },
	{ POINT_ATTBONUS_DESERT, },
	{ POINT_ATTBONUS_INSECT, },
#ifdef ENABLE_WOLFMAN_CHARACTER
	{ POINT_ATTBONUS_CLAW, },
#endif
#endif
#ifdef NEW_BONUS
	{ POINT_ATTBONUS_STONE, },
	{ POINT_ATTBONUS_BOSS, },
#endif
#ifdef ENABLE_YOHARA_SYSTEM
	{ POINT_HIT_PCT, },
	{ POINT_RESIST_MOUNT_FALL, },
	{ POINT_MONSTER_DEFEND_BONUS, },
#endif
// #ifdef USE_DROP_AFFECT_BONUSES
	{ POINT_DOUBLE_DROP_METIN, },
	{ POINT_DOUBLE_DROP_BOSS, },
// #endif
};

const int aiItemMagicAttributePercentHigh[ITEM_ATTRIBUTE_MAX_LEVEL] =
{
	//25, 25, 40, 8, 2,
	30, 40, 20, 8, 2
};

const int aiItemMagicAttributePercentLow[ITEM_ATTRIBUTE_MAX_LEVEL] =
{
	//45, 25, 20, 10, 0,
	50, 40, 10, 0, 0
};

// ADD_ITEM_ATTRIBUTE
const int aiItemAttributeAddPercent[ITEM_ATTRIBUTE_MAX_NUM] =
{
	100, 80, 60, 50, 30, 0, 0,
};
// END_OF_ADD_ITEM_ATTRIBUTE

const int aiExpLossPercents[PLAYER_EXP_TABLE_MAX + 1] =
{
	0,
	5, 5, 5, 5, 5, 5, 5, 5, 5, 4, // 1 - 10
	4, 4, 4, 4, 4, 4, 4, 4, 4, 4, // 11 - 20
	4, 4, 4, 4, 4, 4, 4, 3, 3, 3, // 21 - 30
	3, 3, 3, 3, 3, 3, 3, 3, 3, 3, // 31 - 40
	3, 3, 3, 3, 2, 2, 2, 2, 2, 2, // 41 - 50
	2, 2, 2, 2, 2, 2, 2, 2, 2, 2, // 51 - 60
	2, 2, 1, 1, 1, 1, 1, 1, 1, 1, // 61 - 70
	1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 71 - 80
	1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 81 - 90
	1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 91 - 100
	1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 101 - 110
	1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 111 - 120
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 130
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 140
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 150
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 160
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 170
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 180
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 190
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 200
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 210
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 220
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 230
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 240
	// 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, // 250
};

const int aiSkillBookCountForLevelUp[10] =
{
	3, 3, 3, 3, 3, 4, 4, 5, 5, 6
};

// ADD_GRANDMASTER_SKILL
const int aiGrandMasterSkillBookCountForLevelUp[10] =
{
	3, 3, 5, 5, 7, 7, 10, 10, 10, 20,
};

const int aiGrandMasterSkillBookMinCount[10] =
{
//	1, 1, 3, 5, 10, 15, 20, 30, 40, 50,
//	3, 3, 5, 5, 10, 10, 15, 15, 20, 30
	1, 1, 1, 2,  2,  3,  3,  4,  5,  6
};

const int aiGrandMasterSkillBookMaxCount[10] =
{
//	6, 15, 30, 45, 60, 80, 100, 120, 160, 200,
//	6, 10, 15, 20, 30, 40, 50, 60, 70, 80
	5,  7,  9, 11, 13, 15, 20, 25, 30, 35
};
// END_OF_ADD_GRANDMASTER_SKILL

const int CHN_aiPartyBonusExpPercentByMemberCount[9] =
{
	0, 0, 12, 18, 26, 40, 53, 70, 100
};


// UPGRADE_PARTY_BONUS
const int KOR_aiPartyBonusExpPercentByMemberCount[9] =
{
	0,
	0,
	30, // 66% * 2 - 100
	60, // 53% * 3 - 100
	75, // 44% * 4 - 100
	90, // 38% * 5 - 100
	105, // 34% * 6 - 100
	110, // 30% * 7 - 100
	140, // 30% * 8 - 100
};

const int KOR_aiUniqueItemPartyBonusExpPercentByMemberCount[9] =
{
	0,
	0,
	15*2,
	14*3,
	13*4,
	12*5,
	11*6,
	10*7,
	10*8,
};
// END_OF_UPGRADE_PARTY_BONUS

const int * aiChainLightningCountBySkillLevel = NULL;

const int aiChainLightningCountBySkillLevel_euckr[SKILL_MAX_LEVEL+1] =
{
	0,	// 0
	2,	// 1
	2,	// 2
	2,	// 3
	2,	// 4
	2,	// 5
	2,	// 6
	2,	// 7
	2,	// 8
	3,	// 9
	3,	// 10
	3,	// 11
	3,	// 12
	3,	// 13
	3,	// 14
	3,	// 15
	3,	// 16
	3,	// 17
	3,	// 18
	4,	// 19
	4,	// 20
	4,	// 21
	4,	// 22
	4,	// 23
	5,	// 24
	5,	// 25
	5,	// 26
	5,	// 27
	5,	// 28
	5,	// 29
	5,	// 30
	5,	// 31
	5,	// 32
	5,	// 33
	5,	// 34
	5,	// 35
	5,	// 36
	5,	// 37
	5,	// 38
	5,	// 39
	5,	// 40
};

const SStoneDropInfo aStoneDrop[STONE_INFO_MAX_NUM] =
{
	 // mob	pct	{+0	+1	+2	+3	+4}
	// mob	pct	{+0	+1	+2	+3	+4}
	{8005,	60,	{22,28,	30,	20,	0}	},
	{8006,	60,	{22,28,	30,	20,	0}	},
	{8007,	60,	{22,28,	30,	20,	0}	},
	{8008,	60,	{12,24,	32,	26,	0}	},
	{8009,	60,	{12,24,	32,	26,	0}	},
	{8010,	60,	{12,24,	32,	26,	0}	},
	{8011,	60,	{14,20,	28,	28,	10}	},
	{8013,	60,	{14,20,	28,	28,	10}	},
	{8014,	60,	{14,20,	28,	28,	12}	},
	{8024,	60,	{14,20,	26,	28,	12}	},
	{8025,	60,	{14,20,	26,	28,	12}	},
	{8026,	60,	{14,20,	26,	28,	12}	},
	{8027,	60,	{14,20,	26,	28,	12}	},
	{8051,	60,	{5,	27,	40,	22,	6}	},
	{8052,	60,	{5,	27,	40,	22,	6}	},
	{8053,	60,	{5,	27,	40,	22,	6}	},
	{8054,	60,	{5,	27,	40,	22,	6}	},
	{8055,	60,	{5,	27,	40,	22,	6}	},
	{8056,	60,	{5,	27,	40,	22,	6}	},
	{8059,	60,	{5,	27,	40,	22,	6}	},
	{8061,	60,	{5,	27,	40,	22,	6}	},
	
};

const SChestDrop aChestDrop[CHEST_BOOK_INFO_MAX_NUM] =
{
	// metinvnum	chance1	chance2	chance3	chance4
	{8001,	{55,	55,	55,	55	}},
	{8002,	{55,	55,	55,	55	}},
	{8003,	{55,	55,	55,	55	}},
	{8004,	{55,	55,	55,	55	}},
	{8005,	{55,	55,	55,	55	}},
	{8006,	{55,	55,	55,	55	}},
	{8007,	{55,	55,	55,	55	}},
	{8008,	{55,	55,	55,	55	}},
	{8009,	{55,	55,	55,	55	}},
	{8010,	{55,	55,	55,	55	}},
	{8011,	{55,	55,	55,	55	}},
	{8012,	{55,	55,	55,	55	}},
	{8013,	{55,	55,	55,	55	}},
	{8014,	{55,	55,	55,	55	}},
	{8024,	{55,	55,	55,	55	}},
	{8025,	{55,	55,	55,	55	}},
	{8026,	{55,	55,	55,	55	}},
	{8027,	{55,	55,	55,	55	}},
};

const char * c_apszEmpireNames[EMPIRE_MAX_NUM] =
{
	"ÀüÁ¦±¹",
	"½Å¼ö±¹",
	"ÃµÁ¶±¹",
	"Áø³ë±¹"
};

const char * c_apszPrivNames[MAX_PRIV_NUM] =
{
	"",
	"¾ÆÀÌÅÛÀÌ ³ª¿Ã È®·ü",
	"µ·ÀÌ ³ª¿Ã È®·ü",
	"µ· ´ë¹ÚÀÌ ³ª¿Ã È®·ü",
	"°æÇèÄ¡ ¹èÀ²",
};

const int aiPolymorphPowerByLevel[SKILL_MAX_LEVEL + 1] =
{
	10,   // 1
	11,   // 2
	11,   // 3
	12,   // 4
	13,   // 5
	13,   // 6
	14,   // 7
	15,   // 8
	16,   // 9
	17,   // 10
	18,   // 11
	19,   // 12
	20,   // 13
	22,   // 14
	23,   // 15
	24,   // 16
	26,   // 17
	27,   // 18
	29,   // 19
	31,   // 20
	33,   // 21
	35,   // 22
	37,   // 23
	39,   // 24
	41,   // 25
	44,   // 26
	46,   // 27
	49,   // 28
	52,   // 29
	55,   // 30
	59,   // 31
	62,   // 32
	66,   // 33
	70,   // 34
	74,   // 35
	79,   // 36
	84,   // 37
	89,   // 38
	94,   // 39
	100,  // 40
};

TGuildWarInfo KOR_aGuildWarInfo[GUILD_WAR_TYPE_MAX_NUM] =
/*
   {
   long lMapIndex;
   int iWarPrice;
   int iWinnerPotionRewardPctToWinner;
   int iLoserPotionRewardPctToWinner;
   int iInitialScore;
   int iEndScore;
   };
 */
{
	{ 0,        0,      0,      0,      0,      0       },
	{ 110,      0,      100,    50,     0,      100     },
	{ 111,      0,      100,    50,     0,      10      },
};

//
// ¾Ç¼¼¼­¸® ¼ÒÄÏ¿ë ¼öÄ¡µé
//

// ´ÙÀÌ¾Æ¸óµå·Î ¼ÒÄÏÀ» Ãß°¡ÇÒ ¶§ È®·ü
const int aiAccessorySocketAddPct[ITEM_ACCESSORY_SOCKET_MAX_NUM] =
{
	50, 50, 50
};

// ¾Ç¼¼¼­¸® ¼öÄ¡ °ªÀÇ ¸î%¸¸Å­ÀÇ ¼º´ÉÀ» Ãß°¡ÇÏ´ÂÁö
const int aiAccessorySocketEffectivePct[ITEM_ACCESSORY_SOCKET_MAX_NUM + 1] =
{
	0, 10, 20, 40
};

// ¼ÒÄÏ Áö¼Ó½Ã°£ 24, 12, 6
const int aiAccessorySocketDegradeTime[ITEM_ACCESSORY_SOCKET_MAX_NUM + 1] =
{
	0, 3600 * 24, 3600 * 12, 3600 * 6
};

// ¼ÒÄÏ ÀåÂø ¼º°ø·ü
const int aiAccessorySocketPutPct[ITEM_ACCESSORY_SOCKET_MAX_NUM + 1] =
{
	90, 80, 70, 0
};
// END_OF_ACCESSORY_REFINE

#include "../common/length.h"
// from import_item_proto.c
typedef struct SValueName
{
    const char *	c_pszName;
    long		lValue;
} TValueName;

TValueName c_aApplyTypeNames[] =
{
    { "STR",		APPLY_STR		},
    { "DEX",		APPLY_DEX		},
    { "CON",		APPLY_CON		},
    { "INT",		APPLY_INT		},
    { "MAX_HP",		APPLY_MAX_HP		},
    { "MAX_SP",		APPLY_MAX_SP		},
    { "MAX_STAMINA",	APPLY_MAX_STAMINA	},
    { "POISON_REDUCE",	APPLY_POISON_REDUCE	},
    { "EXP_DOUBLE_BONUS", APPLY_EXP_DOUBLE_BONUS },
    { "GOLD_DOUBLE_BONUS", APPLY_GOLD_DOUBLE_BONUS },
    { "ITEM_DROP_BONUS", APPLY_ITEM_DROP_BONUS	},
    { "HP_REGEN",	APPLY_HP_REGEN		},
    { "SP_REGEN",	APPLY_SP_REGEN		},
    { "ATTACK_SPEED",	APPLY_ATT_SPEED		},
    { "MOVE_SPEED",	APPLY_MOV_SPEED		},
    { "CAST_SPEED",	APPLY_CAST_SPEED	},
    { "ATT_BONUS",	APPLY_ATT_GRADE_BONUS	},
    { "DEF_BONUS",	APPLY_DEF_GRADE_BONUS	},
    { "MAGIC_ATT_GRADE",APPLY_MAGIC_ATT_GRADE	},
    { "MAGIC_DEF_GRADE",APPLY_MAGIC_DEF_GRADE	},
    { "SKILL",		APPLY_SKILL		},
    { "ATTBONUS_ANIMAL",APPLY_ATTBONUS_ANIMAL	},
    { "ATTBONUS_UNDEAD",APPLY_ATTBONUS_UNDEAD	},
    { "ATTBONUS_DEVIL", APPLY_ATTBONUS_DEVIL	},
    { "ATTBONUS_HUMAN", APPLY_ATTBONUS_HUMAN	},
    { "ADD_BOW_DISTANCE",APPLY_BOW_DISTANCE	},
    { "DODGE",		APPLY_DODGE		},
    { "BLOCK",		APPLY_BLOCK		},
    { "RESIST_SWORD",	APPLY_RESIST_SWORD	},
    { "RESIST_TWOHAND",	APPLY_RESIST_TWOHAND	},
    { "RESIST_DAGGER",	APPLY_RESIST_DAGGER    },
    { "RESIST_BELL",	APPLY_RESIST_BELL	},
    { "RESIST_FAN",	APPLY_RESIST_FAN	},
    { "RESIST_BOW",	APPLY_RESIST_BOW	},
    { "RESIST_FIRE",	APPLY_RESIST_FIRE	},
    { "RESIST_ELEC",	APPLY_RESIST_ELEC	},
    { "RESIST_MAGIC",	APPLY_RESIST_MAGIC	},
    { "RESIST_WIND",	APPLY_RESIST_WIND	},
	{ "REFLECT_MELEE",	APPLY_REFLECT_MELEE },
	{ "REFLECT_CURSE",	APPLY_REFLECT_CURSE },
    { "RESIST_ICE",		APPLY_RESIST_ICE	},
    { "RESIST_EARTH",	APPLY_RESIST_EARTH	},
    { "RESIST_DARK",	APPLY_RESIST_DARK	},
    { "RESIST_CRITICAL",	APPLY_ANTI_CRITICAL_PCT	},
    { "RESIST_PENETRATE",	APPLY_ANTI_PENETRATE_PCT	},
    { "POISON",		APPLY_POISON_PCT	},
    { "SLOW",		APPLY_SLOW_PCT		},
    { "STUN",		APPLY_STUN_PCT		},
    { "STEAL_HP",	APPLY_STEAL_HP		},
    { "STEAL_SP",	APPLY_STEAL_SP		},
    { "MANA_BURN_PCT",	APPLY_MANA_BURN_PCT	},
    { "CRITICAL",	APPLY_CRITICAL_PCT	},
    { "PENETRATE",	APPLY_PENETRATE_PCT	},
    { "KILL_SP_RECOVER",APPLY_KILL_SP_RECOVER	},
    { "KILL_HP_RECOVER",APPLY_KILL_HP_RECOVER	},
    { "PENETRATE_PCT",	APPLY_PENETRATE_PCT	},
    { "CRITICAL_PCT",	APPLY_CRITICAL_PCT	},
    { "POISON_PCT",	APPLY_POISON_PCT	},
    { "STUN_PCT",	APPLY_STUN_PCT		},
    { "ATT_BONUS_TO_WARRIOR",	APPLY_ATTBONUS_WARRIOR  },
    { "ATT_BONUS_TO_ASSASSIN",	APPLY_ATTBONUS_ASSASSIN },
    { "ATT_BONUS_TO_SURA",	APPLY_ATTBONUS_SURA	    },
    { "ATT_BONUS_TO_SHAMAN",	APPLY_ATTBONUS_SHAMAN   },
    { "ATT_BONUS_TO_MONSTER",	APPLY_ATTBONUS_MONSTER  },
    { "ATT_BONUS_TO_MOB",	APPLY_ATTBONUS_MONSTER  },
    { "MALL_ATTBONUS",	APPLY_MALL_ATTBONUS	},
    { "MALL_EXPBONUS",	APPLY_MALL_EXPBONUS	},
    { "MALL_DEFBONUS",	APPLY_MALL_DEFBONUS	},
    { "MALL_ITEMBONUS",	APPLY_MALL_ITEMBONUS	},
    { "MALL_GOLDBONUS", APPLY_MALL_GOLDBONUS	},
    { "MAX_HP_PCT",	APPLY_MAX_HP_PCT	},
    { "MAX_SP_PCT",	APPLY_MAX_SP_PCT	},
    { "SKILL_DAMAGE_BONUS",	APPLY_SKILL_DAMAGE_BONUS	},
    { "NORMAL_HIT_DAMAGE_BONUS",APPLY_NORMAL_HIT_DAMAGE_BONUS	},
    { "SKILL_DEFEND_BONUS",	APPLY_SKILL_DEFEND_BONUS	},
    { "NORMAL_HIT_DEFEND_BONUS",APPLY_NORMAL_HIT_DEFEND_BONUS	},
    { "PCBANG_EXP_BONUS", APPLY_PC_BANG_EXP_BONUS	},
    { "PCBANG_DROP_BONUS", APPLY_PC_BANG_DROP_BONUS	},

    { "RESIST_WARRIOR",	APPLY_RESIST_WARRIOR},
    { "RESIST_ASSASSIN",	APPLY_RESIST_ASSASSIN},
    { "RESIST_SURA",		APPLY_RESIST_SURA},
    { "RESIST_SHAMAN",	APPLY_RESIST_SHAMAN},
    // by mhh game/affect.h Á¤ÀÇµÇ¾îÀÖÀ½. INFINITE_AFFECT_DURATION = 0x1FFFFFFF
    { "INFINITE_AFFECT_DURATION", 0x1FFFFFFF	},
	{ "ENERGY", APPLY_ENERGY },		//	±â·Â
	{ "COSTUME_ATTR_BONUS", APPLY_COSTUME_ATTR_BONUS },		//	±â·Â
	{ "MAGIC_ATTBONUS_PER",	APPLY_MAGIC_ATTBONUS_PER	},
    { "MELEE_MAGIC_ATTBONUS_PER",	APPLY_MELEE_MAGIC_ATTBONUS_PER	},

#ifdef ENABLE_WOLFMAN_CHARACTER
	{ "BLEEDING_REDUCE",APPLY_BLEEDING_REDUCE },
	{ "BLEEDING_PCT",APPLY_BLEEDING_PCT },
	{ "ATT_BONUS_TO_WOLFMAN",APPLY_ATTBONUS_WOLFMAN },
	{ "RESIST_WOLFMAN",APPLY_RESIST_WOLFMAN },
	{ "RESIST_CLAW",APPLY_RESIST_CLAW },
#endif

#ifdef ENABLE_ACCE_COSTUME_SYSTEM
	{ "ACCEDRAIN_RATE",APPLY_ACCEDRAIN_RATE },
#endif
#ifdef ENABLE_MAGIC_REDUCTION_SYSTEM
	{ "RESIST_MAGIC_REDUCTION",APPLY_RESIST_MAGIC_REDUCTION },
#endif
#ifdef ENABLE_NEW_BONUS_WORLDARD
	{ "RESIST_HUMAN",	APPLY_RESIST_HUMAN},
#endif
#ifdef ENABLE_YOHARA_SYSTEM
	{ "SUNGMA_STR", APPLY_SUNGMA_STR },
	{ "SUNGMA_HP", APPLY_SUNGMA_HP },
	{ "SUNGMA_MOVE", APPLY_SUNGMA_MOVE },
	{ "SUNGMA_INMUNE", APPLY_SUNGMA_IMMUNE },
#endif
#ifdef NEW_BONUS
	{ "ATTBONUS_STONE", APPLY_ATTBONUS_STONE },
	{ "ATTBONUS_BOSS", APPLY_ATTBONUS_BOSS },
#endif
#ifdef ENABLE_YOHARA_SYSTEM
	{ "HIT_PCT", APPLY_HIT_PCT, },
	{ "RESIST_MOUNT_FALL", APPLY_RESIST_MOUNT_FALL, },
	{ "MONSTER_DEFEND_BONUS", APPLY_MONSTER_DEFEND_BONUS, },
#endif
#ifdef USE_DROP_AFFECT_BONUSES
	{ "APPLY_DOUBLE_DROP_METIN", APPLY_DOUBLE_DROP_METIN, },
	{ "APPLY_DOUBLE_DROP_BOSS", APPLY_DOUBLE_DROP_BOSS, },
#endif
    { NULL,		0			}
};
// from import_item_proto.c

long FN_get_apply_type(const char *apply_type_string)
{
	TValueName	*value_name;
	for (value_name = c_aApplyTypeNames; value_name->c_pszName; ++value_name)
	{
		if (0==strcasecmp(value_name->c_pszName, apply_type_string))
			return value_name->lValue;
	}
	return 0;
}

#ifdef __DUNGEON_INFO__
const std::map<DWORD, std::pair<std::pair<BYTE, BYTE>, std::string>> m_mapDungeonList = {
	//bossIdx, {{minLvl, maxLvl}, questName},
	{1093, {{40, 95}, "deviltower_zone"}},
	{5127, {{50, 90}, "monkeydungeon_zone"}},
	{2092, {{70, 90}, "spiderdungeon3_zone"}},
	{2493, {{70, 105}, "dragonlair_zone"}},
	{2598, {{80, 105}, "devilcatacomb_zone"}},
	{6091, {{90, 120}, "flamedungeon_zone"}},
	{6191, {{90, 120}, "snowdungeon_zone"}},
	{6192, {{105, 120}, "erebus_zone"}},
	{9018, {{105, 120}, "ShipDefense"}},
	{20442, {{110, 120}, "MeleyDungeon"}},
	{4042, {{55, 80}, "nightMare_zone"}},
	{4031, {{115, 120}, "duratusDungeon_zone"}},
	{9838, {{105, 120}, "zodiactemple_zone"}},
	{6500, {{110, 120}, "akzadurlair_zone"}},
	{6756, {{120, 120}, "serpent_zone"}},
	{6790, {{120, 120}, "rxdragonlair_zone"}},
};
#endif

#ifdef __NEW_SET_BONUS__
const std::map<std::string, TNewSetBonus> m_mapNewSetBonus = {

	{
		"SetBonus", TNewSetBonus(
			//{wear_idx, itemIdx}
			{
				{WEAR_COSTUME_BODY, {41324, 41325, 41311, 41312, 49049, 49050, 49286, 49287, 49060, 49061, 49073, 49073, 49086, 49087, 49106, 49107, 49116, 49117, 49126, 49128, 41003, 41004, 11971, 11972, 11973, 11974, 49136, 49137, 34042, 34043, 49126, 49127}},
				{WEAR_COSTUME_HAIR, {45160, 45161, 45148, 45147, 49051, 49052, 49288, 49289, 49062, 49063, 49075, 49075, 49088, 49089, 49108, 49109, 49118, 49119, 49128, 49129, 49138, 49139, 45305, 45306, }},
				{WEAR_COSTUME_WEAPON, {40457, 40460, 40458, 40461, 40462, 40459, 40101, 40104, 40103, 40105, 40106, 49130, 49131, 49132, 49133, 49134, 49135, 40424, 40425, 40426, 40427, 40428, 40429, 49043, 49044, 49045, 49046, 49047, 49048, 49280, 49281, 49282, 49283, 49284, 49285, 49054, 49055, 49056, 49057, 49058, 49059, 49067, 49068, 49069, 49070, 49071, 49071, 49080, 49081, 49082, 49083, 49084, 49085, 49100, 49101, 49102, 49103, 49104, 49105, 49110, 49111, 49112, 49113, 49114, 49115, 49121, 49122, 49123, 49124, 49125, 49120}},
				{WEAR_COSTUME_NEW_SASH, {86065, 86063, 86067, 86004, 86048, 86035, 86036, 86037, 86062, 87013}},
				{WEAR_COSTUME_MOUNT_SKIN, {71247, 71246, 71245, 71235, 71226, 71227, 71228, 71228, 71230, 49313}},
			},
			//{partCount, bonusCount}
			{
				{0, 0},
				{1, 1},
				{2, 1},
				{3, 2},
				{4, 2},
				{5, 3},
			},
			//{bonusIndex, std::make_pair(APPLY_IDX, APPLY_vALUE)},
			{
				{1 , std::make_pair(APPLY_MAX_HP, 1000)},
				{2 , std::make_pair(APPLY_ATTBONUS_MONSTER, 8)},
				{3 , std::make_pair(APPLY_ATTBONUS_STONE, 8)},
			}
		)
	},
	// {
		// "SetBonus - 2", TNewSetBonus(
			//{wear_idx, itemIdx}
			// {
				// {WEAR_WEAPON, 3159},
				// {WEAR_BODY, 11299},
				// {WEAR_HEAD, 12249},
				// {WEAR_SHIELD, 13049},
				// {WEAR_WRIST, 14109},
				// {WEAR_FOOTS, 15189},
				// {WEAR_NECK, 16109},
				// {WEAR_EAR, 17109},
			// },
			//{partCount, bonusCount}
			// {
				// {0, 0},
				// {1, 0},
				// {2, 1},
				// {3, 2},
				// {4, 3},
				// {5, 3},
				// {6, 4},
				// {7, 4},
				// {8, 5},
			// },
			//{bonusIndex, std::make_pair(APPLY_IDX, APPLY_vALUE)},
			// {
				// {1 , std::make_pair(APPLY_MAX_HP, 3000)},
				// {2 , std::make_pair(APPLY_ATTBONUS_MONSTER, 20)},
				// {3 , std::make_pair(APPLY_ATTBONUS_STONE, 20)},
				// {4 , std::make_pair(APPLY_ATTBONUS_BOSS, 20)},
				// {5 , std::make_pair(APPLY_ATTBONUS_HUMAN, 20)},
			// }
		// )
	// },

};
#endif
